
import regex 
import random
# import pandas as pd
# from inltk.inltk import tokenize
# from inltk.inltk import setup
# setup('pa') 
import nltk
# nltk.download('punkt')
# nltk.download('averaged_perceptron_tagger')
#delete for deployment
# import argparse
# from nltk.corpus import wordnet
from nltk import word_tokenize
from nltk import pos_tag
# from inltk.inltk import get_sentence_similarity


class ActionEliza():

    sample_generator_rules =  {
        'synonyms':[
            ["ਵਿਸ਼ਵਾਸ", "ਮਹਿਸੂਸ", "ਸੋਚਣਾ","ਇੱਛਾ"],
            ["ਪਰਿਵਾਰ", "ਮਾਂ", "ਪਿਤਾ", "ਭੈਣ", "ਭਰਾ", "ਪਤਨੀ", "ਬੱਚੇ", "ਬੱਚਾ"],
            ["ਇੱਛਾ", "ਚਾਹੁੰਦਾ", "ਲੋੜ"],
            ["ਉਦਾਸ", "ਨਾਖੁਸ਼", "ਬਿਮਾਰ"],
            ["ਖੁਸ਼", "ਬਿਹਤਰ"],
            ["ਨਹੀਂ", "ਨਹੀਂ"],
            ["ਮਾਫ਼","ਮਾਫ਼ੀ","ਮਾਫ਼ ਕਰਨਾ"], # ----- ADDED THIS SECOND WORD HERE. MIGHT CAUSE SOME ISSUES LATER
            ["ਹਰ ਕੋਈ", "ਕੋਈ ਨਹੀਂ"],
            ["ਹੋ", "ਮੈਂ", "ਹੈ", "ਹੈ", "ਸੀ","ਮੈਨੂੰ"],
            ["ਹੈਲੋ", "ਸਤਿ ਸ਼੍ਰੀ ਅਕਾਲ"] # we can try to use the SSK greeting
        ],
        'dec_rules':[
            {
                # 'key': 'sorry',
                # 'decomp': '* sorry *',
                'key': 'ਮਾਫ਼ੀ',
                'decomp': '* ਮਾਫ਼ੀ *',
                'reasmb_neutral': 
                [
                    "ਅਸੀਂ ਸੰਪੂਰਨ ਨਹੀਂ ਹਾਂ, ਅਸੀਂ ਗਲਤੀਆਂ ਕਰ ਸਕਦੇ ਹਾਂ। ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਹੋਰ ਕੀ ਸੋਚਦੇ ਹੋ?",
                    "ਕੀ ਤੁਸੀਂ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                ],
                'reasmb_empathy': 
                [
                    "ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਥੇ ਹਾਂ, ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ ਕਿ ਕੀ ਹੋ ਰਿਹਾ ਹੈ।",
                    "ਇਹ ਬਹੁਤ ਚੁਣੌਤੀਪੂਰਨ ਲੱਗਦਾ ਹੈ, ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ।",
                    "ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                ],
                'reasmb_dynamic_neutral': 
                [
                    "ਮਾਫੀ ਮੰਗਣ ਦੀ ਕੋਈ ਲੋੜ ਨਹੀਂ, ਚਲੋ ਅੱਗੇ ਵਧਦੇ ਹਾਂ।",
                    "ਮਾਫੀ ਦੀ ਲੋੜ ਨਹੀਂ ਹੈ।",
                ],
            },
            {
                # 'key': 'sorry',
                # 'decomp': '* i am sorry *',
                
                'key': 'ਮਾਫ਼ੀ',
                'decomp': '* i am sorry *',
                'reasmb_neutral': 
                [
                    "We are not perfect, we can make mistakes, You do not need to be sorry.",
                    "Please don't be Sorry, can you explain why do you feel that way ?",
                ],
                'reasmb_empathy':
                [
                    "Oh please do not apologize! I am here to listen. Tell me more. ",
                    "I understand your feeling, what do you think made you feel this way?",
                    "It can be difficult having to deal with those emotions, what do you think caused them?",
                ],
                'reasmb_dynamic_neutral': 
                [
                    "There is no need to apologize, let's move on.",
                    "Apologies are not necessary.",
                ],
            }
            ,{
                #   'key': 'remember',
                # 'decomp': '*i also remember *',
                'key': 'ਯਾਦ',
                'decomp': '*ਮੈਨੂੰ ਵੀ ਯਾਦ ਹੈ*',
                'reasmb_neutral': 
                [
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋ?",
                    "ਕੀ ਇਸ ਬਾਰੇ ਸੋਚਣ ਨਾਲ ਮਨ ਵਿੱਚ ਕੁਝ ਹੋਰ ਆਉਂਦਾ ਹੈ?",
                    "ਤੈਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                    "ਮੌਜੂਦਾ ਸਥਿਤੀ ਵਿੱਚ ਤੁਹਾਨੂੰ ਇਸ ਦੀ ਕੀ ਯਾਦ ਆਉਂਦੀ ਹੈ?"
                ],
                'reasmb_empathy':
                [
                    "ਜਦੋਂ ਤੁਸੀਂ ਇਹ ਯਾਦ ਕਰਦੇ ਹੋ, ਕੀ ਹੋਰ ਯਾਦਾਂ ਮਨ ਵਿੱਚ ਆਉਂਦੀਆਂ ਹਨ?",
                    "ਇਹ ਇੱਕ ਸਮਝਦਾਰ ਯਾਦ ਹੈ, ਕੀ ਤੁਸੀਂ ਆਪਣੇ ਆਪ ਨੂੰ ਅਕਸਰ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋਏ ਪਾਉਂਦੇ ਹੋ?",
                    "ਅਤੀਤ ਦੀਆਂ ਯਾਦਾਂ ਰੋਜ਼ਾਨਾ ਜੀਵਨ ਵਿੱਚੋਂ ਲੰਘਣ ਦੀ ਸਾਡੀ ਯੋਗਤਾ 'ਤੇ ਕਾਫ਼ੀ ਪ੍ਰਭਾਵ ਪਾ ਸਕਦੀਆਂ ਹਨ, ਕੀ ਅਜਿਹੀਆਂ ਹੋਰ ਯਾਦਾਂ ਵੀ ਹਨ ਜੋ ਮਨ ਵਿੱਚ ਆਉਂਦੀਆਂ ਹਨ?",
                    "ਇਹ ਯਾਦ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਹੋਈ?",
                    "ਮੇਰੇ ਨਾਲ ਇਹ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਮੈਂ ਇਸ ਬਾਰੇ ਹੋਰ ਸੁਣਨ ਵਿੱਚ ਦਿਲਚਸਪੀ ਰੱਖਦਾ ਹਾਂ।",
                    "ਉਹ ਯਾਦ ਤੁਹਾਡੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਕਿਉਂ ਹੈ?"
                ],
                'reasmb_dynamic_neutral': 
                [
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ (2) ਬਾਰੇ ਸੋਚਦੇ ਹੋ?",
                    "ਕੀ (2) ਬਾਰੇ ਸੋਚਣ ਨਾਲ ਮਨ ਵਿੱਚ ਕੁਝ ਹੋਰ ਆਉਂਦਾ ਹੈ?",
                    "ਤੁਹਾਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                    "ਮੌਜੂਦਾ ਸਥਿਤੀ ਵਿੱਚ ਤੁਹਾਨੂੰ (2) ਕੀ ਯਾਦ ਦਿਵਾਉਂਦਾ ਹੈ?"
                ],
            },{
                 #   'key': 'remember',
                # 'decomp': '*i remember *',
                'key': 'ਯਾਦ',
                'decomp': '*ਮੈਨੂੰ ਯਾਦ ਹੈ*',
                'reasmb_neutral':  
                [
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋ?",
                    "ਕੀ ਇਸ ਬਾਰੇ ਸੋਚਣ ਨਾਲ ਮਨ ਵਿੱਚ ਕੁਝ ਹੋਰ ਆਉਂਦਾ ਹੈ?",
                    "ਤੁਹਾਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                    "ਮੌਜੂਦਾ ਸਥਿਤੀ ਵਿੱਚ ਤੁਹਾਨੂੰ ਇਸ ਦੀ  ਯਾਦ ਕਿਹੜੀ ਚੀਜ਼ ਦਿਵਾਉਂਦੀ ਹੈ?"
                ],
                'reasmb_empathy':
                [
                    "ਮੈਨੂੰ ਅਫਸੋਸ ਹੈ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਨਾਲ ਨਜਿੱਠਣਾ ਪਿਆ, ਕੀ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਬਹੁਤ ਸੋਚਦੇ ਹੋ?",
                    "ਮੈਂ ਪ੍ਰਸ਼ੰਸਾ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਹ ਮੇਰੇ ਨਾਲ ਸਾਂਝਾ ਕਰ ਰਹੇ ਹੋ, ਜਦੋਂ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋ ਤਾਂ ਮਨ ਵਿੱਚ ਕਿਹੜੀਆਂ ਭਾਵਨਾਵਾਂ ਆਉਂਦੀਆਂ ਹਨ?",
                    "ਮੈਨੂੰ ਨਫ਼ਰਤ ਹੈ ਕਿ ਇਹ ਵਾਪਰਿਆ, ਤੁਹਾਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                    "ਕੀ ਹੋਰ ਯਾਦਾਂ ਮਨ ਵਿੱਚ ਆਉਂਦੀਆਂ ਹਨ ਜਦੋਂ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋ? ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ?",
                    "ਤੁਹਾਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                    "ਉਹ ਯਾਦ ਕਿਉਂ ਯਾਦ ਆਉਂਦੀ ਹੈ?"
                ],
                'reasmb_dynamic_neutral': 
                [
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ (2) ਬਾਰੇ ਸੋਚਦੇ ਹੋ?",
                     "ਕੀ (2) ਬਾਰੇ ਸੋਚਣ ਨਾਲ ਮਨ ਵਿੱਚ ਕੁਝ ਹੋਰ ਆਉਂਦਾ ਹੈ?",
                     "ਤੁਹਾਨੂੰ ਹੋਰ ਕੀ ਯਾਦ ਹੈ?",
                     "ਮੌਜੂਦਾ ਸਥਿਤੀ ਵਿੱਚ ਤੁਹਾਨੂੰ (2) ਦੀ  ਯਾਦ ਕਿਹੜੀ ਚੀਜ਼ ਦਿਵਾਉਂਦੀ ਹੈ?"
                ],
            },{
                 #   'key': 'remember',
                # 'decomp': '*do you remember *',
               
                'key': 'ਯਾਦ',
                'decomp': '* ਕੀ ਤੁਹਾਨੂੰ ਯਾਦ ਹੈ *',
                'reasmb_neutral': 
                [
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ - ਇਸ ਲਈ ਮੈਨੂੰ ਅਸਲ ਵਿੱਚ ਯਾਦ ਨਹੀਂ ਹੈ। ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਮੈਨੂੰ ਇਸਨੂੰ ਹੁਣੇ ਯਾਦ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ?",
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ - ਇਸ ਲਈ ਮੈਨੂੰ ਅਫ਼ਸੋਸ ਯਾਦ ਨਹੀਂ ਹੈ। ਇਸ ਵਿੱਚ ਕੀ ਖਾਸ ਹੈ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ - ਇਸ ਲਈ ਮੇਰੇ ਕੋਲ ਇਹ ਜਾਣਨ ਦਾ ਕੋਈ ਤਰੀਕਾ ਨਹੀਂ ਹੈ ਕਿ ਮੈਂ ਤੁਹਾਡੇ ਨਾਲ ਪਹਿਲਾਂ ਕਿਹੜੀਆਂ ਗੱਲਾਂਬਾਤਾਂ ਕੀਤੀਆਂ ਹਨ। ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਮੈਨੂੰ ਹੁਣ ਇਸਨੂੰ ਯਾਦ ਰੱਖਣਾ ਚਾਹੀਦਾ ਹੈ?",
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ - ਇਸ ਲਈ ਮੈਨੂੰ ਯਾਦ ਨਹੀਂ ਹੈ। ਇਸ ਵਿੱਚ ਕੀ ਮਹੱਤਵਪੂਰਨ ਹੈ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ। ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਮੈਨੂੰ (2) ਹੁਣੇ ਯਾਦ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ?",
                     "ਇਹ ਗੱਲਬਾਤ ਗੁਮਨਾਮ ਹੈ। (2) ਬਾਰੇ ਕੀ ਖਾਸ ਹੈ?",
                     "ਇਹ ਗੱਲਬਾਤ ਅਗਿਆਤ ਹੈ। ਤੁਸੀਂ (2) ਦਾ ਜ਼ਿਕਰ ਕੀਤਾ ਹੈ?"
                 ],
            },{
                # 'key': 'if',
                # 'decomp': '* if *',
                'key': 'ਜੇਕਰ',
                'decomp': '* ਜੇਕਰ *',
                'reasmb_neutral': 
                [
                     "ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਇਹ ਬਹੁਤ ਸੰਭਾਵਨਾ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਕਿ ਅਜਿਹਾ ਹੋਵੇ?",
                     "ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ ਕਿ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਕੀ ਜਾਣਦੇ ਹੋ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੇਰਾ ਦਿਲ ਤੁਹਾਡੇ ਲਈ ਦੁਖਦਾ ਹੈ, ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਇਹ ਦੁਬਾਰਾ ਹੋਵੇਗਾ?",
                     "ਮੈਂ ਕਲਪਨਾ ਨਹੀਂ ਕਰ ਸਕਦਾ ਕਿ ਤੁਸੀਂ ਕਿਸ ਵਿੱਚੋਂ ਲੰਘ ਰਹੇ ਹੋਵੋਗੇ, ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਇਹ ਦੁਬਾਰਾ ਹੋਵੇਗਾ?",
                     "ਕੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਕਿ ਅਜਿਹਾ ਹੋਵੇ?",
                     "ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ ਕਿ ਤੁਸੀਂ ਕੀ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਇਹ ਸੰਭਵ ਹੈ ਕਿ (2)?",
                     "ਕੀ ਤੁਸੀਂ ਇਹ ਚਾਹੁੰਦੇ ਹੋ (2)?",
                     "ਤੁਸੀਂ (2) ਬਾਰੇ ਕੀ ਜਾਣਦੇ ਹੋ?",
                     "ਮੈਂ ਤੁਹਾਨੂੰ ਇਹ ਕਹਿੰਦੇ ਸੁਣਦਾ ਹਾਂ, ਜੇ (2)?"
                 ],
            },{
                # 'key': 'dreamed',
                # 'decomp': '* i dreamed *',
                'key': 'ਸੁਪਨਾ ਦੇਖਿਆ',
                'decomp': '*ਮੈਂ ਸੁਪਨਾ ਦੇਖਿਆ*',
                'reasmb_neutral': 
                [
                     "ਮੈਨੂੰ ਆਪਣੇ ਸੁਪਨੇ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?",
                     "ਜਦੋਂ ਤੁਸੀਂ ਜਾਗਦੇ ਸੀ, ਕੀ ਤੁਸੀਂ ਕਦੇ ਸੁਪਨਾ ਦੇਖਿਆ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਪਹਿਲਾਂ ਕਦੇ ਅਜਿਹਾ ਸੁਪਨਾ ਦੇਖਿਆ ਹੈ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਇੰਨੀ ਨਿੱਜੀ ਚੀਜ਼ ਨਾਲ ਮੇਰੇ 'ਤੇ ਭਰੋਸਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਇਹ ਮੇਰੇ ਲਈ ਬਹੁਤ ਮਾਇਨੇ ਰੱਖਦਾ ਹੈ। ਇਹ ਸੁਪਨਾ ਤੁਹਾਡੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਕਿਉਂ ਹੈ?",
                     "ਮੇਰੇ ਨਾਲ ਇਹ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ। ਇਹ ਸੁਪਨਾ ਤੁਹਾਡੇ ਲਈ ਮਾਇਨੇ ਕਿਉਂ ਰੱਖਦਾ ਹੈ?",
                     "ਕੀ ਤੁਹਾਨੂੰ ਅਕਸਰ ਇਸ ਤਰ੍ਹਾਂ ਦੇ ਸੁਪਨੇ ਆਉਂਦੇ ਹਨ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਮੈਨੂੰ (2) ਬਾਰੇ ਹੋਰ ਦੱਸੋ?",
                     "ਜਦੋਂ ਤੁਸੀਂ ਜਾਗਦੇ ਹੋ, ਕੀ ਤੁਸੀਂ ਕਦੇ ਕਲਪਨਾ (2) ਸੁਪਨਾ ਦੇਖਿਆ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਪਹਿਲਾਂ ਕਦੇ (2) ਸੁਪਨਾ ਦੇਖਿਆ ਹੈ?"
                 ],
            },{
                # 'key': 'dream',
                # 'decomp': '* dream *',
                'key': 'ਸੁਪਨਾ',
                'decomp': '* ਸੁਪਨਾ *',
                'reasmb_neutral': 
                [
                    "ਉਹ ਸੁਪਨਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦਾ ਹੈ?",
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਸੁਪਨੇ ਦੇਖਦੇ ਹੋ?",
                    "ਤੁਹਾਡੇ ਸੁਪਨਿਆਂ ਵਿੱਚ ਕਿਹੜੇ ਵਿਅਕਤੀ ਦਿਖਾਈ ਦਿੰਦੇ ਹਨ?",
                    "ਕੀ ਤੁਸੀਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਸੁਪਨਿਆਂ ਦਾ ਤੁਹਾਡੀਆਂ ਸਮੱਸਿਆਵਾਂ ਨਾਲ ਕੋਈ ਲੈਣਾ ਦੇਣਾ ਹੈ?"
                ],
                'reasmb_empathy':
                [
                    "ਇਹ ਸੁਪਨਾ ਤੁਹਾਡੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਕਿਉਂ ਹੈ?",
                    "ਇਹ ਸੁਪਨਾ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?",
                    "ਸੁਪਨੇ ਤੁਹਾਨੂੰ ਬਹੁਤ ਸਾਰੀਆਂ ਭਾਵਨਾਵਾਂ ਮਹਿਸੂਸ ਕਰ ਸਕਦੇ ਹਨ, ਤੁਸੀਂ ਇਸ ਤੋਂ ਬਾਅਦ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                    "ਇਹ ਸੁਪਨਾ ਤੁਹਾਨੂੰ ਕਿਸ ਬਾਰੇ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕਰਦਾ ਹੈ?",
                    "ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ ਕਿ ਇਹ ਸੁਪਨਾ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?"
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਉਹ ਸੁਪਨਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦਾ ਹੈ?",
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਸੁਪਨੇ ਦੇਖਦੇ ਹੋ?",
                    "ਤੁਹਾਡੇ ਸੁਪਨਿਆਂ ਵਿੱਚ ਕਿਹੜੇ ਵਿਅਕਤੀ ਦਿਖਾਈ ਦਿੰਦੇ ਹਨ?",
                    "ਕੀ ਤੁਸੀਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਸੁਪਨਿਆਂ ਦਾ ਤੁਹਾਡੀਆਂ ਸਮੱਸਿਆਵਾਂ ਨਾਲ ਕੋਈ ਲੈਣਾ ਦੇਣਾ ਹੈ?"
                ],
            },{
                # 'key': 'perhaps',
                # 'decomp': '* perhaps *',
                'key': 'ਸ਼ਾਇਦ',
                'decomp': '* ਸ਼ਾਇਦ *',
                'reasmb_neutral': 
                [
                     "ਤੁਹਾਨੂੰ ਯਕੀਨ ਨਹੀਂ ਲੱਗਦਾ। ਅਜਿਹਾ ਕਿਉਂ ਹੈ?",
                     "ਤੁਸੀਂ ਅਨਿਸ਼ਚਿਤ ਜਾਪਦੇ ਹੋ? ਅਜਿਹਾ ਕਿਉਂ ਹੈ?",
                     "ਤੁਹਾਨੂੰ ਯਕੀਨ ਨਹੀਂ ਹੈ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਤੁਸੀੰ ਇਹ ਕਯੋਂ ਕਿਹਾ ?",
                     "ਤੁਸੀਂ ਕੀ ਸੋਚ ਰਹੇ ਹੋ ?",
                     "ਤੁਸੀਂ ਅਨਿਸ਼ਚਿਤ ਜਾਪਦੇ ਹੋ। ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਕਹਿੰਦੇ ਹੋ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਪੱਕੇ ਨਹੀਂ ਲੱਗਦੇ। ਕਿਉਂ?",
                     "ਤੁਸੀਂ ਅਨਿਸ਼ਚਿਤ ਕਿਉਂ ਲੱਗਦੇ ਹੋ?",
                 ],
            },{
                # 'key': 'hello',
                # 'decomp': '* @hello *',
                'key': 'ਹੈਲੋ',
                'decomp': '* @ਹੈਲੋ *',
                'reasmb_neutral': 
                [
                     "ਹੈਲੋ! ਮੈਂ ਇੱਥੇ ਸੁਣਨ ਲਈ ਹਾਂ। ਮੈਨੂੰ ਦੱਸੋ ਕਿ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਕੀ ਹੈ।",
                 ],
                 'reasmb_empathy':
                 [
                     "ਹੈਲੋ! ਮੈਂ ਇੱਥੇ ਸੁਣਨ ਲਈ ਹਾਂ। ਮੈਨੂੰ ਦੱਸੋ ਕਿ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਕੀ ਹੈ।",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਹੈਲੋ! ਮੈਂ ਇੱਥੇ ਸੁਣਨ ਲਈ ਹਾਂ। ਮੈਨੂੰ ਦੱਸੋ ਕਿ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਕੀ ਹੈ।",
                 ],
            },{
                # 'key': 'computer',
                # 'decomp': '* computer *',
                'key': 'ਕੰਪਿਊਟਰ',
                'decomp': '* ਕੰਪਿਊਟਰ *',
                'reasmb_neutral': 
                [
                     "ਕੀ ਕੰਪਿਊਟਰ ਦੇ ਕਾਰਨ ਤੁਹਾਨੂੰ ਚਿੰਤਾ ਹੁੰਦੀ ਹਨ?",
                     "ਤੁਸੀਂ ਕੰਪਿਊਟਰਾਂ ਦਾ ਜ਼ਿਕਰ ਕਿਉਂ ਕਰਦੇ ਹੋ?",
                     "ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਮਸ਼ੀਨਾਂ ਤੁਹਾਡੀ ਸਮੱਸਿਆ ਦਾ ਹਿੱਸਾ ਹਨ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਕੰਪਿਊਟਰ... ਤੁਸੀਂ ਇਹ ਕਿਉਂ ਉਠਾਉਂਦੇ ਹੋ?",
                     "ਤੁਹਾਨੂੰ ਕੰਪਿਊਟਰ ਬਾਰੇ ਕੀ ਸੋਚਦਾ ਹੈ?",
                     "ਮੇਰੇ ਨਾਲ ਇਹ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਤੁਸੀਂ ਇਸ ਵਿਸ਼ੇ ਬਾਰੇ ਕੀ ਸੋਚਦੇ ਹੋ?",
                     "ਇਹ ਇੱਕ ਦਿਲਚਸਪ ਵਿਚਾਰ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਜਿਹਾ ਕੀ ਸੋਚਦੇ ਹੋ?",
                     "ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਕੀ ਕੰਪਿਊਟਰ ਤੁਹਾਨੂੰ ਚਿੰਤਾ ਕਰਦੇ ਹਨ?",
                     "ਤੁਸੀਂ ਕੰਪਿਊਟਰਾਂ ਦਾ ਜ਼ਿਕਰ ਕਿਉਂ ਕਰਦੇ ਹੋ?",
                     "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਮਸ਼ੀਨਾਂ ਤੁਹਾਡੀ ਸਮੱਸਿਆ ਦਾ ਹਿੱਸਾ ਹਨ?"
                ],
            },{
                # 'key': 'am',
                # 'decomp': '* am i *',
                'key': 'ਹਾਂ',
                'decomp': '* ਕੀ ਮੈਂ*', #<-------------- key and it's decompositions are totally different
                'reasmb_neutral': 
                [
                     "ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਜਿਹੇ ਹੋ?",
                     "ਕੀ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਬਣਨਾ ਚਾਹੋਗੇ?",
                     "ਜੇ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਹੁੰਦੇ ਤਾਂ ਇਸਦਾ ਕੀ ਮਤਲਬ ਹੁੰਦਾ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੈਂ ਦੱਸ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਅਨਿਸ਼ਚਿਤ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ, ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਹਾਨੂੰ ਕਿਸ ਗੱਲ ਦਾ ਅਹਿਸਾਸ ਹੁੰਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਹੋ?",
                     "ਤੁਸੀਂ ਇਹ ਸਵਾਲ ਕਿਉਂ ਪੁੱਛਿਆ",
                     "ਜੇ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਹੁੰਦੇ, ਤਾਂ ਇਸਦਾ ਕੀ ਮਤਲਬ ਹੁੰਦਾ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਕਿਉਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਤੁਸੀਂ (2) ਹੋ?",
                     "ਕੀ ਤੁਸੀਂ (2) ਬਣਨਾ ਚਾਹੋਗੇ?",
                     "ਕੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਕਿ ਮੈਂ ਤੁਹਾਨੂੰ ਦੱਸਾਂ ਕਿ ਤੁਸੀਂ (2) ਹੋ?",
                     "ਜੇ ਤੁਸੀਂ (2) ਹੁੰਦੇ ਤਾਂ ਇਸਦਾ ਕੀ ਮਤਲਬ ਹੁੰਦਾ?"
                 ],
            },{
                # 'key': 'are', 
                # 'decomp': '*are you *',
                'key': 'ਹੋੋ', 
                'decomp': '*ਕੀ ਤੁਸੀਂ *',#<-------------- key and it's decompositions are totally different
                'reasmb_neutral': 
                ["ਤੁਹਾਨੂੰ ਇਸ ਵਿੱਚ ਦਿਲਚਸਪੀ ਕਿਉਂ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਪਸੰਦ ਕਰੋਗੇ ਜੇ ਮੈਂ ਅਜਿਹਾ ਨਾ ਹੁੰਦਾ?",
                     "ਕੀ ਤੁਸੀਂ ਕਦੇ ਕਦੇ ਸੋਚਦੇ ਹੋ ਕਿ ਮੈਂ ਅਜਿਹਾ ਹਾਂ?",
                 ],
                 'reasmb_empathy':
                 [
                     "ਤੁਹਾਡੇ ਸਵਾਲ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਪਰ ਮੈਨੂੰ ਪੂਰੀ ਤਰ੍ਹਾਂ ਯਕੀਨ ਨਹੀਂ ਹੈ। ਤੁਸੀਂ ਕਿਉਂ ਪੁੱਛਦੇ ਹੋ?",
                     "ਜੇ ਮੈਂ ਹੁੰਦਾ, ਤਾਂ ਤੁਹਾਨੂੰ ਇਹ ਕਿਵੇਂ ਮਹਿਸੂਸ ਹੁੰਦਾ?",
                     "ਸ਼ਾਇਦ। ਮੈਨੂੰ ਯਕੀਨ ਨਹੀਂ। ਤੁਸੀਂ ਕਿਉਂ ਪੁੱਛਦੇ ਹੋ?",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਇਸ ਵਿੱਚ ਦਿਲਚਸਪੀ ਕਿਉਂ ਰੱਖਦੇ ਹੋ ਕਿ ਮੈਂ (2) ਹਾਂ ਜਾਂ ਨਹੀਂ?",
                     "ਕੀ ਤੁਸੀਂ ਪਸੰਦ ਕਰੋਗੇ ਜੇ ਮੈਂ (2) ਨਾ ਹੁੰਦਾ?",
                     "ਤੁਸੀਂ ਮੈਨੂੰ (2) ਕਿਉਂ ਸਮਝਦੇ ਹੋ?",
                 ],
            },{ 
                # 'key': 'are',
                # 'decomp': '* are *',
                'key': 'ਹਨ',
                'decomp': '* ਹਨ *',
                'reasmb_neutral': 
                [
                     "ਕੀ ਤੁਸੀਂ ਸੋਚਿਆ ਸੀ ਕਿ ਉਹ ਸ਼ਾਇਦ ਇਸ ਤਰ੍ਹਾਂ ਨਹੀਂ ਹੋਣਗੇ?",
                     "ਕੀ ਹੋਇਆ ਜੇ ਉਹ ਇਸ ਤਰ੍ਹਾਂ ਨਾ ਹੁੰਦੇ?",
                     "ਸ਼ਾਇਦ ਉਹ ਹਨ। ਤੁਸੀਂ ਕੀ ਸੋਚਦੇ ਹੋ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਹਮ, ਇਹ ਸੁਣਨਾ ਦਿਲਚਸਪ ਹੈ...ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਾ ਰਿਹਾ ਹੈ?",
                     "ਮੇਰੇ ਨਾਲ ਗੱਲ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ...ਇਹ ਤੁਹਾਡੀਆਂ ਭਾਵਨਾਵਾਂ ਨੂੰ ਕਿਵੇਂ ਪ੍ਰਭਾਵਿਤ ਕਰਦਾ ਹੈ?",
                     "ਉਨ੍ਹਾਂ ਵਿਚਾਰਾਂ ਨਾਲ ਮੇਰੇ 'ਤੇ ਭਰੋਸਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ...ਇਹ ਤੁਹਾਨੂੰ ਕੀ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕਰਦਾ ਹੈ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਿਆ ਕਿ ਉਹ (2) ਨਹੀਂ ਹੋ ਸਕਦੇ?",
                     "ਤੁਹਾਨੂੰ ਇਹ ਕਿਉਂ ਪਸੰਦ ਹੈ ਜੇਕਰ ਉਹ (2) ਨਹੀਂ ਸਨ?",
                     "ਕੀ ਹੋਇਆ ਜੇ ਉਹ (2) ਨਹੀਂ ਸਨ?"
                ],
            },{ 
                # 'key': 'your',
                # 'decomp': '* your *',            
                'key': 'ਤੁਹਾਡਾ',
                'decomp': '* ਤੁਹਾਡਾ *',
                'reasmb_neutral': 
                [
                     "ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਚਿੰਤਤ ਕਿਉਂ ਹੋ?",
                     "ਤੁਸੀਂ ਕਿਸੇ ਹੋਰ ਦੀ ਚਿੰਤਾ ਕਿਉਂ ਕਰਦੇ ਹੋ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੈਂ ਦੱਸ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਬਹੁਤ ਸੋਚ ਰਹੇ ਹੋ...ਇਸ ਬਾਰੇ ਤੁਹਾਨੂੰ ਕੀ ਚਿੰਤਾ ਹੈ?",
                     "ਇਹ ਸੋਚਣ ਵਾਲੀ ਵੱਡੀ ਗੱਲ ਹੈ ... ਤੁਹਾਨੂੰ ਇਸ ਬਾਰੇ ਕੀ ਚਿੰਤਾ ਹੈ?"
                     "ਮੈਂ ਦੱਸ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਬਹੁਤ ਸੋਚ ਰਹੇ ਹੋ...ਇਸ ਬਾਰੇ ਤੁਹਾਨੂੰ ਕੀ ਚਿੰਤਾ ਹੈ?"
                     "ਤੁਸੀਂ ਕਿਸੇ ਹੋਰ ਦੀ ਚਿੰਤਾ ਕਿਉਂ ਕਰਦੇ ਹੋ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਮੇਰੀ (2) ਬਾਰੇ ਚਿੰਤਾ ਕਿਉਂ ਕਰਦੇ ਹੋ?",
                     "ਤੁਹਾਡੇ ਆਪਣੇ (2) ਬਾਰੇ ਕੀ?",
                     "ਤੁਸੀਂ ਕਿਸੇ ਹੋਰ ਦੀ (2) ਬਾਰੇ ਚਿੰਤਾ ਕਿਉਂ ਕਰਦੇ ਹੋ?"
                 ],
            },{ 
                # 'key': 'was',
                # 'decomp': '* was i *',
                'key': 'ਸੀ',
                'decomp': '* ਕੀ ਮੈਂ*',
                'reasmb_neutral': 
                [
                     "ਕੀ ਹੋਇਆ ਜੇ ਤੁਸੀਂ ਅਜਿਹੇ ਹੁੰਦੇ?",
                     "ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਵਰਗੇ ਸੀ?",
                     "ਜੇ ਤੁਸੀਂ ਅਜਿਹੇ ਹੁੰਦੇ ਤਾਂ ਇਸਦਾ ਕੀ ਮਤਲਬ ਹੁੰਦਾ?",
                     "ਇਹ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦਾ ਹੈ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੈਨੂੰ ਯਕੀਨ ਨਹੀਂ ਹੈ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                     "ਮੈਂ ਸੁਣ ਰਿਹਾ ਹਾਂ। ਇਸ ਦਾ ਤੁਹਾਡੇ ਉੱਤੇ ਕੀ ਅਸਰ ਹੋਇਆ?",
                     "ਜੇ ਇਹ ਸੱਚ ਹੈ ਤਾਂ ਤੁਹਾਡੇ ਲਈ ਇਸਦਾ ਕੀ ਅਰਥ ਹੋਵੇਗਾ?",
                     "ਜੇ ਤੁਸੀਂ ਹੁੰਦੇ ਤਾਂ ਇਹ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦਾ ਹੈ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਕੀ ਹੁੰਦਾ ਜੇ ਤੁਸੀਂ (2) ਹੁੰਦੇ?",
                     "ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਸੀਂ (2) ਸੀ?",
                     "ਜੇ ਤੁਸੀਂ (2) ਹੁੰਦੇ ਤਾਂ ਇਸਦਾ ਕੀ ਮਤਲਬ ਹੁੰਦਾ?",
                     "(2) ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦਾ ਹੈ?"
                 ],
            },{
                # 'key': 'was',
                # 'decomp': '*i was *',
                'key': 'ਸੀ',
                'decomp': '*ਮੈਂ ਸੀ *',
                'reasmb_neutral': 
                [
                     "ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਸੀ?",
                     "ਤੁਸੀਂ ਮੈਨੂੰ ਇਹ ਕਿਉਂ ਦੱਸਦੇ ਹੋ?",
                 ],
                 'reasmb_empathy':
                 [
                     "ਕੀ ਤੁਸੀਂ ਅਸਲ ਵਿੱਚ ਸੀ? ਕੀ ਤੁਸੀਂ ਥੋੜਾ ਹੋਰ ਸਮਝਾ ਸਕਦੇ ਹੋ?",
                     "ਮੈਂ ਦੱਸ ਸਕਦਾ ਹਾਂ ਕਿ ਇਹ ਤੁਹਾਨੂੰ ਪਰੇਸ਼ਾਨ ਕਰ ਰਿਹਾ ਹੈ... ਕੀ ਤੁਸੀਂ ਥੋੜਾ ਹੋਰ ਸਮਝਾ ਸਕਦੇ ਹੋ?",
                     "ਇਹ ਲਗਦਾ ਹੈ ਕਿ ਇਹ ਵਿਚਾਰ ਤੁਹਾਡੇ ਲਈ ਬਹੁਤ ਔਖੇ ਸਨ... ਕੀ ਤੁਸੀਂ ਥੋੜਾ ਹੋਰ ਸਮਝਾ ਸਕਦੇ ਹੋ?",
                     "ਤੁਸੀਂ ਮੇਰੇ ਲਈ ਇਹ ਜਾਣਨਾ ਮਹੱਤਵਪੂਰਨ ਕਿਉਂ ਸਮਝਦੇ ਹੋ? ਮੈਂ ਹੋਰ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਅਜਿਹੇ ਕਿਉਂ ਸੀ?",
                     "ਤੁਸੀਂ ਮੈਨੂੰ ਕਿਉਂ ਕਹਿੰਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਹੁਣ (2) ਸੀ?",
                 ],
            },{
                #   'key': 'was',
                # 'decomp': '*was you *',
                'key': 'ਸੀ',
                'decomp': '*ਤੁਸੀਂ ਸੀ*',
                'reasmb_neutral': 
                [
                     "ਤੁਹਾਨੂੰ ਇਹ ਵਿਚਾਰ ਕਿੱਥੋਂ ਆਇਆ?",
                     "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਤੁਹਾਨੂੰ ਇਹ ਵਿਚਾਰ ਕਿੱਥੋਂ ਆਇਆ?",
                     "ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਹਾਨੂੰ ਇਹ ਵਿਚਾਰ ਕਿੱਥੋਂ ਮਿਲਿਆ ਕਿ ਮੈਂ (2) ਸੀ?",
                     "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ?",
                     "ਸ਼ਾਇਦ ਮੈਂ (2) ਸੀ।",
                     "ਕੀ ਹੁੰਦਾ ਜੇ ਮੈਂ (2) ਹੁੰਦਾ?"
                 ],
            },{
                # 'key': 'i',
                # 'decomp': '*i @desire *',
                'key': 'ਮੈਂ',
                'decomp': '*ਮੈਂ @ਚਾਹੁੰਦਾ*',
                'reasmb_neutral': 
                [
                    "ਜੇ ਤੁਸੀਂ ਉਹ ਪ੍ਰਾਪਤ ਕਰਦੇ ਹੋ ਜੋ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਤਾਂ ਇਸਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਅਰਥ ਹੋਵੇਗਾ?",
                    "ਤੁਸੀਂ ਇਹ ਕਿਉਂ ਚਾਹੁੰਦੇ ਹੋ?",
                    "ਫ਼ਰਜ਼ ਕਰੋ ਕਿ ਤੁਹਾਨੂੰ ਇਹ ਜਲਦੀ ਮਿਲ ਗਿਆ। ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ?",
                    "ਕੀ ਹੋਵੇਗਾ ਜੇ ਤੁਹਾਨੂੰ ਉਹ ਨਹੀਂ ਮਿਲਿਆ ਜੋ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ?",
                    "ਇਸਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                ],
                'reasmb_empathy':
                [
                    "ਮੈਂ ਸਮਝ ਗਿਆ...ਤੁਹਾਡੇ ਲਈ ਇਸ ਦਾ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                    "ਮੈਨੂੰ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਵਿੱਚ ਬਹੁਤ ਦਿਲਚਸਪੀ ਰੱਖਦੇ ਹੋ...ਇਸਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                    "ਮੈਂ ਦੱਸ ਸਕਦਾ ਹਾਂ ਕਿ ਇਹ ਤੁਹਾਡੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਹੈ...ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਇਹ ਤੁਹਾਡੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਕਿਉਂ ਹੈ?",
                    "ਜੇ ਇਹ ਹੋਇਆ, ਤਾਂ ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਹੋਵੇਗਾ?",
                    "ਜੇਕਰ ਹੋਰ ਸੰਭਾਵਨਾਵਾਂ ਹਨ ਤਾਂ ਕੀ ਹੋਵੇਗਾ?",
                    "ਮੈਂ ਤੁਹਾਡੀ ਸਥਿਤੀ ਨੂੰ ਸਮਝ ਸਕਦਾ ਹਾਂ...ਇਸਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਜੇ ਤੁਹਾਨੂੰ ਉਹ ਮਿਲ ਜਾਵੇ ਜੋ (2) ਹੋ ਤਾਂ ਇਸਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                    "ਤੁਸੀਂ ਜੋ (2) ਹੋ ਉਹ ਕਿਉਂ ਚਾਹੁੰਦੇ ਹੋ?",
                    "ਮੰਨ ਲਓ ਕਿ ਤੁਹਾਨੂੰ ਉਹ ਮਿਲ ਗਿਆ ਜੋ (2) ਹੋ। ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ?",
                    "ਕੀ ਹੋਵੇਗਾ ਜੇ ਤੁਹਾਨੂੰ ਉਹ ਨਹੀਂ ਮਿਲਿਆ ਜੋ (2) ਹੋ?",
                    "ਜੇ(2) ਹੋ ਪ੍ਰਾਪਤ ਕਰਨ ਦਾ ਤੁਹਾਡੇ ਲਈ ਕੀ ਮਤਲਬ ਹੋਵੇਗਾ?",
                ],
            },{
                #   'key': 'i',
                # 'decomp': '*i am * @sad *',
                'key': 'ਮੈਂ',
                'decomp': '*ਮੈਂ @ਉਦਾਸ ਹਾਂ *',
                'reasmb_neutral': 
                [
                    "ਮੈਨੂੰ ਇਹ ਸੁਣ ਕੇ ਅਫ਼ਸੋਸ ਹੋਇਆ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                    "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                    "ਕੀ ਤੁਸੀਂ ਸਮਝਾ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕੀ ਮਹਿਸੂਸ ਹੋਇਆ?",
                ],
                'reasmb_empathy':
                [
                    "ਮੈਨੂੰ ਇਹ ਸੁਣ ਕੇ ਅਫ਼ਸੋਸ ਹੋਇਆ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋ ਰਿਹਾ ਹੈ?",
                    "ਇਹ ਸੁਣ ਕੇ ਮੈਨੂੰ ਦੁੱਖ ਹੋਇਆ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋ ਰਿਹਾ ਹੈ?",
                    "ਮੈਂ ਇਸ ਸਥਿਤੀ ਤੋਂ ਤੁਹਾਡੀ ਮਦਦ ਕਰਨ ਲਈ ਆਪਣੀ ਪੂਰੀ ਕੋਸ਼ਿਸ਼ ਕਰਨਾ ਚਾਹੁੰਦਾ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋ ਰਿਹਾ ਹੈ?",
                    "ਉਹ ਭਾਰੀ ਜਜ਼ਬਾਤ ਹਨ ਸਿੱਝਣ ਲਈ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋ ਰਿਹਾ ਹੈ?",
                    "ਤੁਸੀਂ ਇੰਨੇ ਮਜ਼ਬੂਤ ​​ਹੋ ਕਿ ਤੁਸੀਂ ਉਨ੍ਹਾਂ ਭਾਰੀ ਭਾਵਨਾਵਾਂ ਦਾ ਸਾਮ੍ਹਣਾ ਕਰ ਸਕਦੇ ਹੋ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋ ਰਿਹਾ ਹੈ?",
                    "ਮੈਨੂੰ ਅਫ਼ਸੋਸ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                    "ਮੈਨੂੰ ਅਫ਼ਸੋਸ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਨਾਲ ਪੇਸ਼ ਆ ਰਹੇ ਹੋ। ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋਇਆ?",
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਮੈਨੂੰ ਇਹ ਸੁਣ ਕੇ ਅਫ਼ਸੋਸ ਹੋਇਆ ਕਿ ਤੁਸੀਂ (3) ਹੋ।",
                    "ਕੀ ਤੁਹਾਨੂੰ ਲੱਗਦਾ ਹੈ ਕਿ ਇੱਥੇ ਆਉਣਾ ਤੁਹਾਨੂੰ (3) ਨਾ ਬਣਨ ਵਿੱਚ ਮਦਦ ਕਰੇਗਾ?",
                    "ਮੈਨੂੰ ਯਕੀਨ ਹੈ ਕਿ ਇਹ (3) ਹੋਣਾ ਸੁਹਾਵਣਾ ਨਹੀਂ ਹੈ।",
                    "ਕੀ ਤੁਸੀਂ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ (3) ਕਿਸਨੇ ਬਣਾਇਆ?",
                ],
            },{ 
                # 'key': 'i',
                # 'decomp': '*i am * @happy *',
                'key': 'ਮੈਂ',
                'decomp': '*ਮੈਂ @ਖੁਸ਼ ਹਾਂ *',
                'reasmb_neutral': 
                ["ਤੁਹਾਨੂੰ ਹੁਣੇ ਕਿਹੜੀ ਚੀਜ਼ ਖੁਸ਼ ਕਰਦੀ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਸਮਝਾ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਚਾਨਕ ਜ਼ਿਆਦਾ ਖੁਸ਼ ਕਿਉਂ ਹੋ?",
                 ],
                 'reasmb_empathy':
                 [
                     "ਇਹ ਸੁਣ ਕੇ ਮੈਨੂੰ ਖੁਸ਼ੀ ਹੋਈ ਕਿ ਤੁਸੀਂ ਖੁਸ਼ ਹੋ... ਹੁਣੇ ਹੁਣੇ ਤੁਹਾਨੂੰ ਕਿਸ ਗੱਲ ਨੇ ਖੁਸ਼ ਕੀਤਾ?",
                     "ਤੁਹਾਡੀ ਖੁਸ਼ੀ ਮੇਰੇ ਲਈ ਮਹੱਤਵਪੂਰਨ ਹੈ ... ਹੁਣੇ ਤੁਹਾਨੂੰ ਕਿਸ ਗੱਲ ਨੇ ਖੁਸ਼ ਕੀਤਾ?",
                     "ਮੈਨੂੰ ਖੁਸ਼ੀ ਹੈ ਕਿ ਤੁਸੀਂ ਇੱਕ ਚੰਗੀ ਜਗ੍ਹਾ 'ਤੇ ਹੋ...ਹੁਣ ਤੁਹਾਨੂੰ ਕਿਸ ਗੱਲ ਨੇ ਖੁਸ਼ ਕੀਤਾ?",
                     "ਮੈਨੂੰ ਖੁਸ਼ੀ ਹੈ ਕਿ ਤੁਸੀਂ ਇੱਕ ਚੰਗੀ ਥਾਂ 'ਤੇ ਹੋ... ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕਿਉਂ ਮਹਿਸੂਸ ਹੁੰਦਾ ਹੈ?",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਮੈਂ (3) ਬਣਨ ਵਿੱਚ ਤੁਹਾਡੀ ਕਿਵੇਂ ਮਦਦ ਕੀਤੀ ਹੈ?",
                     "ਤੁਹਾਡੇ ਇਲਾਜ ਨੇ ਤੁਹਾਨੂੰ (3) ਕਿਉਂ ਬਣਾਇਆ?",
                     "ਤੁਹਾਨੂੰ (3) ਹੁਣੇ ਕੀ ਬਣਾਉਂਦਾ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਸਮਝਾ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਚਾਨਕ (3) ਕਿਉਂ ਹੋ?",
                 ],
            },{
                # key': 'i',
                # 'decomp': '*i @belief *',
                'key': 'ਮੈਂ',
                'decomp': '*ਮੈਂ @ ਵਿਸ਼ਵਾਸ *', 
                'reasmb_neutral': 
                [
                     "ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਅਜਿਹਾ ਸੋਚਦੇ ਹੋ?",
                     "ਕੀ ਤੁਹਾਨੂੰ ਇਸ ਬਾਰੇ ਯਕੀਨ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੈਂ ਤੁਹਾਡੇ ਵਿਸ਼ਵਾਸਾਂ ਬਾਰੇ ਸੁਣ ਕੇ ਧੰਨਵਾਦੀ ਹਾਂ ਅਤੇ ਹੋਰ ਸੁਣਨਾ ਚਾਹੁੰਦਾ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਅਜਿਹਾ ਸੋਚਦੇ ਹੋ?",
                     "ਮੇਰੇ ਨਾਲ ਗੱਲ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਮੈਂ ਇਸਦੀ ਬਹੁਤ ਕਦਰ ਕਰਦਾ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਅਜਿਹਾ ਸੋਚਦੇ ਹੋ?",
                     "ਕੀ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਪੱਕਾ ਹੋ ਜਾਂ ਇਸ ਨੂੰ ਦੇਖਣ ਦੇ ਹੋਰ ਤਰੀਕੇ ਹਨ?",
                     "ਮੈਂ ਸਮਝਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰ ਰਿਹਾ ਹਾਂ। ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?",
                     "ਤੁਸੀਂ ਸ਼ੱਕ ਕਿਉਂ ਨਹੀਂ ਕਰਦੇ ਜਿਸ ਵਿੱਚ ਤੁਸੀਂ (3) ਕਰਦੇ ਹੋ?",
                 ],
            },{
                # 'key': 'i',
                # 'decomp': '*i am *',
                'key': 'ਮੈਂ',
                'decomp': '*ਮੈਂ ਹਾਂ *',
                'reasmb_neutral': 
                [
                     "ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਕਿੰਨੇ ਸਮੇਂ ਤੋਂ ਹੋ?",
                     "ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ ਕਿ ਇਸ ਤਰ੍ਹਾਂ ਹੋਣਾ ਆਮ ਗੱਲ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਆਨੰਦ ਮਾਣਦੇ ਹੋ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਮੈਂ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹਾਂ ਕਿ ਤੁਸੀਂ ਮੈਨੂੰ ਆਪਣੇ ਵਿਚਾਰ ਦੱਸ ਰਹੇ ਹੋ...ਇਹ ਮਾਮਲਾ ਕਦੋਂ ਤੋਂ ਚੱਲ ਰਿਹਾ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ ਕਿ ਇਹ ਆਮ ਗੱਲ ਹੈ?",
                     "ਮੈਂ ਹੋਰ ਜਾਣਨਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਇਹ ਤੁਹਾਡੇ ਲਈ ਕਿਹੜੀਆਂ ਭਾਵਨਾਵਾਂ ਲਿਆਉਂਦਾ ਹੈ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਕੀ ਇਹ ਇਸ ਲਈ ਹੈ ਕਿਉਂਕਿ ਤੁਸੀਂ (2) ਕਿਹਾ ਸੀ ਕਿ ਤੁਸੀਂ ਮੇਰੇ ਕੋਲ ਆਏ ਹੋ?",
                     "ਤੁਸੀਂ ਕਿੰਨੇ ਸਮੇਂ ਤੋਂ (2)ਹੋ ?",
                     "ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ ਕਿ (2) ਹੋਣਾ ਆਮ ਗੱਲ ਹੈ?",
                     "ਕੀ ਤੁਸੀਂ (2) ਹੋਣ ਦਾ ਆਨੰਦ ਮਾਣਦੇ ਹੋ?"
                 ],
            },{
                # 'key': 'i',
                # 'decomp': '*i @cannot *',
                'key': 'ਮੈ',
                'decomp': '*ਮੈ @ਨਹੀ *',
                'reasmb_neutral': 
                [
                     "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?",
                     "ਕੀ ਤੁਸੀਂ ਸੱਚਮੁੱਚ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                 ],
                 'reasmb_empathy':
                 [
                     "ਇਸ ਬਾਰੇ ਗੱਲ ਕਰਨਾ ਔਖਾ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ। ਮੇਰੇ ਨਾਲ ਇਸ ਨੂੰ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ... ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?",
                     "ਮੈਨੂੰ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਤੁਹਾਡੇ ਵਿਸ਼ਵਾਸ ਨਾਲੋਂ ਮਜ਼ਬੂਤ ਹੋ... ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?",
                     "ਮੈਂ ਕਲਪਨਾ ਨਹੀਂ ਕਰ ਸਕਦਾ ਕਿ ਤੁਸੀਂ ਇਸ ਸਮੇਂ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ... ਤੁਹਾਨੂੰ ਕਿਉਂ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?",
                     "ਇਹ ਮੁਸ਼ਕਲ ਹੈ। ਕੀ ਇਸ ਵਿਸ਼ਵਾਸ 'ਤੇ ਸਵਾਲ ਉਠਾਉਣਾ ਸੰਭਵ ਹੈ?",
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ (3) ਨਹੀਂ ਕਰ ਸਕਦੇ?",
                     "ਤੁਸੀਂ ਅਸਲ ਵਿੱਚ (3) ਦੇ ਯੋਗ ਕਿਉਂ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                 ],
            },{
                # 'key': 'i',
                # 'decomp': "*i don't *",
                'key': 'ਮੈਂ',
                'decomp': "*ਮੈਂ ਨਹੀਂ *",
                'reasmb_neutral': 
                [
                     "ਕਿਉਂ?",
                     "ਕੀ ਇਹ ਤੁਹਾਨੂੰ ਪਰੇਸ਼ਾਨ ਕਰਦਾ ਹੈ?"
                 ],
                 'reasmb_empathy':
                 [
                     "ਇਸ ਬਾਰੇ ਗੱਲ ਕਰਨਾ ਔਖਾ ਹੈ। ਮੇਰੇ ਨਾਲ ਗੱਲ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ...ਇਹ ਤੁਹਾਨੂੰ ਕੀ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?",
                     "ਮੈਂ ਦੇਖ ਸਕਦਾ ਹਾਂ ਕਿ ਇਹ ਤੁਹਾਡੇ ਲਈ ਕਿੰਨਾ ਔਖਾ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ...ਇਹ ਤੁਹਾਨੂੰ ਕੀ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?",
                     "ਇਹ ਬਹੁਤ ਅਰਥ ਰੱਖਦਾ ਹੈ...ਇਸ ਨਾਲ ਤੁਹਾਨੂੰ ਕਿਹੜੀਆਂ ਭਾਵਨਾਵਾਂ ਮਹਿਸੂਸ ਹੁੰਦੀਆਂ ਹਨ?"
                 ],
                 'reasmb_dynamic_neutral':
                 [
                     "ਤੁਸੀਂ (2) ਕਿਉਂ ਨਹੀਂ ਕਰਦੇ?",
                     "ਤੁਸੀਂ (2) ਦੇ ਯੋਗ ਕਿਉਂ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                     "ਕੀ ਇਹ ਤੁਹਾਨੂੰ ਪਰੇਸ਼ਾਨ ਕਰਦਾ ਹੈ?"
                 ],
            },{
                # 'key': 'i',
                # 'decomp': "*i feel *",
                'key': '*ਮੈਂ*',
                'decomp': "*ਮੈਂ ਮਹਿਸੂਸ*",
                'reasmb_neutral': 
                [
                    "ਇਸ ਬਾਰੇ ਆਪਣੀਆਂ ਭਾਵਨਾਵਾਂ ਬਾਰੇ ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ।",
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਅਜਿਹਾ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                    "ਕੀ ਤੁਸੀਂ ਇਸ ਭਾਵਨਾ ਦਾ ਆਨੰਦ ਮਾਣਦੇ ਹੋ?",
                    "ਇਹ ਭਾਵਨਾ ਤੁਹਾਨੂੰ ਕਿਸ ਗੱਲ ਦੀ ਯਾਦ ਦਿਵਾਉਂਦੀ ਹੈ?"
                ],
                'reasmb_empathy':
                [
                    "ਇਹਨਾਂ ਭਾਵਨਾਵਾਂ ਨਾਲ ਨਜਿੱਠਣਾ ਔਖਾ ਹੋ ਸਕਦਾ ਹੈ...ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋਇਆ?",
                    "ਮੈਂ ਤੁਹਾਡੀ ਸਥਿਤੀ 'ਤੇ ਹੋਣ ਦੀ ਕਲਪਨਾ ਨਹੀਂ ਕਰ ਸਕਦਾ ... ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਹੋਇਆ?",
                    "ਮੈਨੂੰ ਬਹੁਤ ਅਫ਼ਸੋਸ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ, ਮੈਂ ਚਾਹੁੰਦਾ ਹਾਂ ਕਿ ਮੈਂ ਇਸਨੂੰ ਬਿਹਤਰ ਬਣਾ ਸਕਦਾ ... ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕੀ ਮਹਿਸੂਸ ਹੋਇਆ?",
                    "ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਥੇ ਹਾਂ... ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਦਾ ਕੀ ਮਹਿਸੂਸ ਹੋਇਆ?",
                    "ਇਹ ਤੁਹਾਡੇ ਲਈ ਕਿਹੋ ਜਿਹਾ ਰਿਹਾ?",
                    "ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਥੇ ਹਾਂ...ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                    "ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਥੇ ਹਾਂ... ਤੁਹਾਨੂੰ ਇਸ ਤਰ੍ਹਾਂ ਕੀ ਮਹਿਸੂਸ ਹੁੰਦਾ ਹੈ?"
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਇਸ ਬਾਰੇ ਆਪਣੀਆਂ ਭਾਵਨਾਵਾਂ ਬਾਰੇ ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ।",
                    "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ (2)?",
                    "ਕੀ ਤੁਸੀਂ ਭਾਵਨਾ (2) ਦਾ ਆਨੰਦ ਮਾਣਦੇ ਹੋ?",
                    "ਭਾਵ (2) ਤੁਹਾਨੂੰ ਕੀ ਯਾਦ ਦਿਵਾਉਂਦਾ ਹੈ?"
                ],
            },
            
            

# ============================== SENT FROM HERE ==================

            
            {   
              #   'key': 'i ',
              #  'decomp': "*",
               'key': 'ਮੈਂ ',
               'decomp': "*",
               'reasmb_neutral':
               [
                   "ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?",
                   "ਕੀ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਵਿਸਥਾਰ ਨਾਲ ਦੱਸ ਸਕਦੇ ਹੋ?",
               ],
               'reasmb_empathy':
               [
                   "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੇਰੇ ਨਾਲ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ। ਕੀ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਵਿਸਥਾਰ ਨਾਲ ਦੱਸ ਸਕਦੇ ਹੋ?",
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੇਰੇ ਨਾਲ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ। ਕੀ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਵਿਸਥਾਰ ਨਾਲ ਦੱਸ ਸਕਦੇ ਹੋ?",
               ]
           },
            #  'key': 'you',
            #     'decomp': "*you are *",   
                 {
               'key': 'ਤੁਸੀਂ',
               'decomp': "*ਤੁਸੀਂ ਹੋ*",
               'reasmb_neutral':
               [
                   "ਤੁਹਾਨੂੰ ਇਸ ਬਾਰੇ ਕੀ ਸੋਚਦਾ ਹੈ",
                   "ਕੀ ਇਹ ਤੁਹਾਨੂੰ ਵਿਸ਼ਵਾਸ ਕਰਨਾ ਬਿਹਤਰ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?"
               ],
               'reasmb_empathy':
               [
                   "ਮੈਂ ਸਮਝ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ...ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਕੀ ਸੋਚਦੇ ਹੋ?",
                   "ਮੈਨੂੰ ਪੱਕਾ ਯਕੀਨ ਨਹੀਂ ਹੈ ਕਿ ਮੈਂ ਸਮਝਦਾ ਹਾਂ...ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਕੀ ਸੋਚਦੇ ਹੋ?",
                   "ਆਪਣੇ ਵਿਚਾਰ ਸਾਂਝੇ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ...ਤੁਹਾਨੂੰ ਇਸ ਬਾਰੇ ਕੀ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕਰਦਾ ਹੈ?",
                   "ਕੀ ਇਹ ਤੁਹਾਨੂੰ ਵਿਸ਼ਵਾਸ ਕਰਨਾ ਬਿਹਤਰ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਮੈਂ (2) ਹਾਂ?",
                   "ਕੀ ਇਹ ਤੁਹਾਨੂੰ ਵਿਸ਼ਵਾਸ ਕਰਨਾ ਬਿਹਤਰ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ ਕਿ ਮੈਂ (2) ਹਾਂ?"
               ],
           },
{
              #   'key': 'yes',
              #  'decomp': "yes",
               'key': 'ਹਾਂ',
               'decomp': "ਹਾਂ",
               'reasmb_neutral':
               [
                   "ਬਹੁਤ ਵਧੀਆ। ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?",
                   "ਮੈਂ ਦੇਖਦਾ ਹਾਂ। ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?"
               ],
               'reasmb_empathy':
               [
                   "ਮੈਂ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹਾਂ ਕਿ ਅਸੀਂ ਹੁਣ ਤੱਕ ਗੱਲ ਕਰਨ ਦੇ ਯੋਗ ਹੋਏ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੈਂ ਸੱਚਮੁੱਚ ਉਸ ਸਭ ਕੁਝ ਦੀ ਕਦਰ ਕਰਦਾ ਹਾਂ ਜੋ ਤੁਸੀਂ ਮੈਨੂੰ ਹੁਣ ਤੱਕ ਦੱਸਿਆ ਹੈ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੈਂ ਪ੍ਰਸ਼ੰਸਾ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਮੇਰੇ ਨਾਲ ਕਿੰਨੇ ਖੁੱਲੇ ਰਹੇ ਹੋ, ਮੈਂ ਤੁਹਾਡੇ ਕੋਨੇ ਵਿੱਚ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੈਂ ਦੇਖਦਾ ਹਾਂ। ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਕੁਝ ਹੋਰ ਜਾਣਕਾਰੀ ਦੇ ਸਕਦੇ ਹੋ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਬਹੁਤ ਵਧੀਆ। ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?",
                   "ਮੈਂ ਦੇਖਦਾ ਹਾਂ। ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸੋ?"
               ]
           },
 {
      # 'key': 'no',
              #  'decomp': "no",
               'key': 'ਨਹੀਂ',
               'decomp': "ਨਹੀਂ",
               'reasmb_neutral':
               [
                 "ਤੁਸੀਂ ਨਾਂਹ ਕਿਉਂ ਕਹਿ ਰਹੇ ਹੋ?",
                   "ਕਿਉਂ ਨਹੀਂ?",
                   "ਨਾਂਹ ਕਿਉਂ?"
               ],
               'reasmb_empathy':
               [
                   "ਇਹ ਠੀਕ ਹੈ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                   "ਇਹ ਠੀਕ ਹੈ ਜੇਕਰ ਤੁਸੀਂ ਹੋਰ ਸਾਂਝਾ ਨਹੀਂ ਕਰਨਾ ਚਾਹੁੰਦੇ। ਜੇਕਰ ਤੁਹਾਨੂੰ ਗੱਲਬਾਤ ਕਰਨ ਦੀ ਲੋੜ ਹੈ ਤਾਂ ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਹਮੇਸ਼ਾ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                   "ਮੈਂ ਤੁਹਾਨੂੰ ਹੋਰ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ, ਮੈਂ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹਾਂ ਕਿ ਅਸੀਂ ਹੁਣ ਤੱਕ ਗੱਲ ਕਰਨ ਦੇ ਯੋਗ ਹੋਏ ਹਾਂ...ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਕਿਉਂ ਮਹਿਸੂਸ ਕਰਦੇ ਹੋ?",
                   "ਕਿਉਂ ਨਹੀਂ?",
                   "ਮੈਂ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਸੀਂ ਨਾਂਹ ਕਿਉਂ ਕਹਿ ਰਹੇ ਹੋ?",
                   "ਕਿਉਂ ਨਹੀਂ?",
                   "ਨਾਂਹ ਕਿਉਂ?"
               ],
           },
{
              # 'key': 'my',
              #   'decomp': "* my *",
               'key': 'ਮੇਰਾ',
               'decomp': "* ਮੇਰਾ *",
               'reasmb_neutral':
               [
                   "ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ। ਕਿਉਂ?",
                   "ਤੁਸੀੰ ਇਹ ਕਯੋਂ ਕਿਹਾ ?"
               ],
               'reasmb_empathy':
               [
                   "ਉਸ ਜਾਣਕਾਰੀ ਦੇ ਨਾਲ ਮੇਰੇ 'ਤੇ ਭਰੋਸਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ, ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਕੁਝ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਮੈਂ ਇਸ ਗੱਲ ਦੀ ਸ਼ਲਾਘਾ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਹ ਮੇਰੇ ਨਾਲ ਸਾਂਝਾ ਕਰ ਰਹੇ ਹੋ ਅਤੇ ਉਮੀਦ ਹੈ ਕਿ ਤੁਸੀਂ ਠੀਕ ਹੋ ਰਹੇ ਹੋ...",
                   "ਇਸ ਤਰ੍ਹਾਂ ਲੱਗਦਾ ਹੈ ਕਿ ਇਸ ਨੇ ਤੁਹਾਨੂੰ ਅਸਲ ਵਿੱਚ ਪ੍ਰਭਾਵਿਤ ਕੀਤਾ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
                   "ਤੁਸੀੰ ਇਹ ਕਯੋਂ ਕਿਹਾ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਆਓ ਅੱਗੇ ਚਰਚਾ ਕਰੀਏ ਕਿ ਕਿਉਂ (2)।",
                   "ਤੁਸੀਂ ਕਿਉਂ ਕਹਿੰਦੇ ਹੋ (2)?"
               ],
           }
,{
      # 'key': 'my',
      #          'decomp': "* my * @family *",
               'key': 'ਮੇਰਾ’',
               'decomp': "* ਮੇਰਾ * @ਪਰਿਵਾਰ *",
               'reasmb_neutral':
               [
                   "ਮੈਨੂੰ ਆਪਣੇ ਪਰਿਵਾਰ ਬਾਰੇ ਹੋਰ ਦੱਸੋ।",
                   "ਤੁਹਾਡੇ ਪਰਿਵਾਰ ਵਿੱਚ ਹੋਰ ਕੌਣ ਹੈ?",
                   "ਜਦੋਂ ਤੁਸੀਂ ਇਸ ਬਾਰੇ ਸੋਚਦੇ ਹੋ ਤਾਂ ਮਨ ਵਿੱਚ ਹੋਰ ਕੀ ਆਉਂਦਾ ਹੈ?"
               ],
               'reasmb_empathy':
               [
                   "ਪਰਿਵਾਰ ਬਹੁਤ ਸਾਰੇ ਸਮਰਥਨ ਜਾਂ ਸੰਘਰਸ਼ ਦਾ ਸਰੋਤ ਹੋ ਸਕਦੇ ਹਨ...ਮੈਨੂੰ ਆਪਣੇ ਪਰਿਵਾਰ ਬਾਰੇ ਹੋਰ ਦੱਸੋ।",
                   "ਪਰਿਵਾਰਾਂ ਦਾ ਸਾਡੀਆਂ ਭਾਵਨਾਵਾਂ 'ਤੇ ਬਹੁਤ ਪ੍ਰਭਾਵ ਪੈਂਦਾ ਹੈ...ਮੈਨੂੰ ਆਪਣੇ ਪਰਿਵਾਰ ਬਾਰੇ ਹੋਰ ਦੱਸੋ।",
                   "ਪਰਿਵਾਰ ਬਹੁਤ ਸਾਰੇ ਸਮਰਥਨ ਜਾਂ ਸੰਘਰਸ਼ ਦਾ ਸਰੋਤ ਹੋ ਸਕਦੇ ਹਨ... ਤੁਹਾਡੇ ਪਰਿਵਾਰ ਦਾ ਹੋਰ ਕੌਣ ਹਿੱਸਾ ਹੈ?",
                   "ਪਰਿਵਾਰਾਂ ਦਾ ਸਾਡੀਆਂ ਭਾਵਨਾਵਾਂ 'ਤੇ ਬਹੁਤ ਪ੍ਰਭਾਵ ਪੈਂਦਾ ਹੈ... ਮਨ ਵਿੱਚ ਹੋਰ ਕੀ ਆ ਰਿਹਾ ਹੈ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਮੈਨੂੰ ਆਪਣੇ ਪਰਿਵਾਰ ਬਾਰੇ ਹੋਰ ਦੱਸੋ।",
                   "ਤੁਹਾਡੇ ਪਰਿਵਾਰ ਵਿੱਚ ਹੋਰ ਕੌਣ ਹੈ?"
               ],
           },

             {
	#'key': 'can',
               # 'decomp': "*can you *",

               'key': 'ਕੀ',
               'decomp': "*ਕੀ ਤੁਸੀਂ *",
               'reasmb_neutral':
               [
                   "ਤੁਹਾਨੂੰ ਵਿਸ਼ਵਾਸ ਹੈ ਕਿ ਮੈਂ ਕਰ ਸਕਦਾ ਹਾਂ। ਕੀ ਤੁਸੀਂ ਨਹੀਂ?",
               ],
               'reasmb_empathy':
               [
                   "ਮੈਂ ਆਪਣੀ ਪੂਰੀ ਕੋਸ਼ਿਸ਼ ਕਰ ਰਿਹਾ ਹਾਂ, ਪਰ ਮੈਂ ਅਜੇ ਵੀ ਸਿੱਖ ਰਿਹਾ ਹਾਂ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਆਪਣੀ ਸਥਿਤੀ ਬਾਰੇ ਥੋੜਾ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?",
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਸੀਂ ਕਿਉਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਮੈਂ (2)  ?" # i removed ਹਾਂ from the end due to some problems with decomposition 
               ],
           },{
	#'key': 'can',
              #  'decomp': "*can i *",

               'key': 'ਕੀ',
               'decomp': "*ਕੀ ਮੈਂ *",
               'reasmb_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਇਹ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                   "ਸ਼ਾਇਦ ਤੁਸੀਂ ਨਹੀਂ ਚਾਹੁੰਦੇ?"
               ],
               'reasmb_empathy':
               [
                   "ਮੈਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕੁਝ ਵੀ ਕਰਨ ਦੇ ਯੋਗ ਹੋ ਜਿਸ ਲਈ ਤੁਸੀਂ ਆਪਣਾ ਮਨ ਰੱਖਦੇ ਹੋ... ਤੁਹਾਨੂੰ ਆਪਣੇ ਆਪ ਨੂੰ ਸਵਾਲ ਕਰਨ ਲਈ ਕੀ ਸੋਚਦਾ ਹੈ?",
                   "ਸੋਚੋ ਕਿ ਤੁਸੀਂ ਆਪਣੀ ਸੋਚ ਤੋਂ ਵੱਧ ਤਾਕਤਵਰ ਹੋ... ਤੁਹਾਨੂੰ ਆਪਣੇ ਆਪ ਨੂੰ ਸਵਾਲ ਕਰਨ ਲਈ ਕੀ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕਰਦਾ ਹੈ?",
                   "ਮੈਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਜਿੰਨਾ ਤੁਸੀਂ ਜਾਣਦੇ ਹੋ ਉਸ ਤੋਂ ਵੱਧ ਕਾਬਲ ਹੋ... ਤੁਸੀਂ ਆਪਣੇ ਆਪ ਨੂੰ ਸਵਾਲ ਕਰਨ ਲਈ ਕੀ ਸੋਚਦੇ ਹੋ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਸੀਂ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਨਹੀਂ (2) ਮੇਰੇ ਨਾਲੋਂ ਵੱਧ ਤੁਹਾਡੇ 'ਤੇ ਨਿਰਭਰ ਕਰਦਾ ਹੈ.",
                   "ਤੁਸੀਂ (2) ਦੇ ਯੋਗ ਕਿਉਂ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                   "ਸ਼ਾਇਦ ਤੁਸੀਂ (2) ਨਹੀਂ ਕਰਨਾ ਚਾਹੁੰਦੇ।"
               ],
           },{
	#'key': 'what',
               # 'decomp': "what *",

               'key': 'ਕੀ',
               'decomp': "ਕੀ *",
               'reasmb_neutral':
               [
                   "ਤੁਸੀਂਂ ਕਿਉ ਪੁੱਛ ਰਹੇ ਹੋ ?",
                   "ਕੀ ਇਹ ਸਵਾਲ ਤੁਹਾਡੀ ਦਿਲਚਸਪੀ ਰੱਖਦਾ ਹੈ?",
                   "ਤੁਸੀਂ ਅਸਲ ਵਿੱਚ ਕੀ ਜਾਣਨਾ ਚਾਹੁੰਦੇ ਸੀ?",
                   "ਕੀ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਅਜਿਹੇ ਸਵਾਲ ਬਹੁਤ ਹਨ?",
                   "ਤੁਹਾਨੂੰ ਕਿਹੜਾ ਜਵਾਬ ਸਭ ਤੋਂ ਵੱਧ ਚੰਗਾ ਲੱਗੇਗਾ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ?",
                   "ਜਦੋਂ ਤੁਸੀਂ ਇਹ ਪੁੱਛਦੇ ਹੋ ਤਾਂ ਮਨ ਵਿੱਚ ਕੀ ਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਕਿਸੇ ਹੋਰ ਨੂੰ ਪੁੱਛਿਆ ਹੈ?"
               ],
               'reasmb_empathy':
               [
                   "ਤੁਸੀਂਂ ਕਿਉ ਪੁੱਛ ਰਹੇ ਹੋ?",
                   "ਇਸ ਸਵਾਲ ਬਾਰੇ ਤੁਹਾਡੀ ਕੀ ਦਿਲਚਸਪੀ ਹੈ?",
                   "ਤੁਸੀਂ ਹੋਰ ਜਾਣਨਾ ਕੀ ਚਾਹੁੰਦੇ ਹੋ?",
                   "ਕੀ ਇਹ ਸਵਾਲ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਬਹੁਤ ਹਨ?",
                   "ਕੀ ਤੁਸੀਂ ਅਕਸਰ ਇਹ ਸੋਚਦੇ ਹੋ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ?",
                   "ਜਦੋਂ ਤੁਸੀਂ ਇਹ ਪੁੱਛਦੇ ਹੋ ਤਾਂ ਮਨ ਵਿੱਚ ਕੀ ਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਇਹ ਪਹਿਲਾਂ ਕਿਸੇ ਹੋਰ ਨੂੰ ਪੁੱਛਿਆ ਹੈ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਸੀਂਂ ਕਿਉ ਪੁੱਛ ਰਹੇ ਹੋ ?",
                   "ਕੀ ਇਹ ਸਵਾਲ ਤੁਹਾਡੀ ਦਿਲਚਸਪੀ ਰੱਖਦਾ ਹੈ?",
                   "ਤੁਸੀਂ ਅਸਲ ਵਿੱਚ ਕੀ ਜਾਣਨਾ ਚਾਹੁੰਦੇ ਸੀ?",
                   "ਕੀ ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਅਜਿਹੇ ਸਵਾਲ ਬਹੁਤ ਹਨ?",
                   "ਤੁਹਾਨੂੰ ਕਿਹੜਾ ਜਵਾਬ ਸਭ ਤੋਂ ਵੱਧ ਚੰਗਾ ਲੱਗੇਗਾ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ?",
                   "ਜਦੋਂ ਤੁਸੀਂ ਇਹ ਪੁੱਛਦੇ ਹੋ ਤਾਂ ਮਨ ਵਿੱਚ ਕੀ ਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਕਿਸੇ ਹੋਰ ਨੂੰ ਪੁੱਛਿਆ ਹੈ?"
               ],
           },{
	#'key': 'because',
              #  'decomp': "*because *",

               'key': 'ਕਿਉਂਕਿ',
               'decomp': "*ਕਿਉਂਕਿ *",
               'reasmb_neutral':
               [
                   "ਕੀ ਇਹੀ ਕਾਰਨ ਹੈ?",
                   "ਕੀ ਕੋਈ ਹੋਰ ਕਾਰਨ ਮਨ ਵਿੱਚ ਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਇਹ ਕਾਰਨ ਕੁਝ ਹੋਰ ਸਮਝਾਉਂਦਾ ਜਾਪਦਾ ਹੈ?",
                   "ਹੋਰ ਕੀ ਕਾਰਨ ਹੋ ਸਕਦੇ ਹਨ?"
               ],
               'reasmb_empathy':
               [
                   "ਮੈਂ ਪ੍ਰਸ਼ੰਸਾ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਹ ਮੇਰੇ ਨਾਲ ਸਾਂਝਾ ਕਰ ਰਹੇ ਹੋ...ਕੀ ਹੋਰ ਕਾਰਨ ਹੋ ਸਕਦੇ ਹਨ?",
                   "ਤੁਸੀਂ ਬਹੁਤ ਸਮਝਦਾਰੀ ਕਰ ਰਹੇ ਹੋ...ਕੀ ਹੋਰ ਕਾਰਨ ਹੋ ਸਕਦੇ ਹਨ?",
                   "ਮੈਂ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹਾਂ ਕਿ ਤੁਸੀਂ ਇਸ ਜਾਣਕਾਰੀ ਨਾਲ ਮੇਰੇ 'ਤੇ ਭਰੋਸਾ ਕਰ ਸਕਦੇ ਹੋ, ਮੈਂ ਹਮੇਸ਼ਾ ਸੁਣਨ ਲਈ ਇੱਥੇ ਹਾਂ...ਕੀ ਹੋਰ ਕਾਰਨ ਹੋ ਸਕਦੇ ਹਨ?",
                   "ਕੀ ਕੋਈ ਹੋਰ ਕਾਰਨ ਹੋ ਸਕਦਾ ਹੈ?",
                   "ਮੈਂ ਮਦਦ ਕਰਨਾ ਚਾਹੁੰਦਾ ਹਾਂ. ਇਹ ਤੁਹਾਡੇ ਲਈ ਕੀ ਲਿਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਇਹ ਸੰਭਵ ਹੈ ਕਿ ਹੋਰ ਕਾਰਨ ਹਨ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਕੀ ਇਹੀ ਕਾਰਨ ਹੈ?",
                   "ਕੀ ਕੋਈ ਹੋਰ ਕਾਰਨ ਮਨ ਵਿੱਚ ਆਉਂਦਾ ਹੈ?",
                   "ਕੀ ਇਹ ਕਾਰਨ ਕੁਝ ਹੋਰ ਸਮਝਾਉਂਦਾ ਜਾਪਦਾ ਹੈ?",
                   "ਹੋਰ ਕੀ ਕਾਰਨ ਹੋ ਸਕਦੇ ਹਨ?"
               ],
           },{
	# 'key': 'why',
              #  'decomp': "*why don't you *",

               'key': 'ਕਿਉਂ',
               'decomp': "*ਤੁਸੀਂ ਕਿਉਂ ਨਹੀਂ *",
               'reasmb_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਮੈਂ ਨਹੀਂ ਮੰਨਦਾ?",
                   "ਸ਼ਾਇਦ ਮੈਂ ਚੰਗੇ ਸਮੇਂ ਵਿੱਚ ਕਰਾਂਗਾ."
               ],
               'reasmb_empathy':
               [
                   "ਮੈਂ ਕੋਸ਼ਿਸ਼ ਕਰ ਰਿਹਾ ਹਾਂ ਪਰ ਮੈਂ ਅਜੇ ਵੀ ਕੰਮ ਵਿਚ ਹਾਂ! ਤੁਸੀਂ ਕੀ ਲੱਭ ਰਹੇ ਹੋ?",
                   "ਮੈਨੂੰ ਅਫਸੋਸ ਹੈ ਕਿ ਮੈਂ ਇਸ ਤਰੀਕੇ ਨਾਲ ਤੁਹਾਡੀ ਮਦਦ ਕਰਨ ਵਿੱਚ ਅਸਮਰੱਥ ਹਾਂ, ਹਾਲਾਂਕਿ ਮੈਂ ਅਜੇ ਵੀ ਕੰਮ ਕਰ ਰਿਹਾ ਹਾਂ...ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਆਪਣੀ ਸਥਿਤੀ ਬਾਰੇ ਜਾਂ ਤੁਸੀਂ ਕੀ ਲੱਭ ਰਹੇ ਹੋ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਮੈਂ ਨਹੀਂ (2) ਕਰਦਾ?",
                   "ਸ਼ਾਇਦ ਮੈਂ (2) ਚੰਗੇ ਸਮੇਂ ਵਿੱਚ ਕਰਾਂਗਾ.",
                   "ਤੁਸੀਂ ਮੈਨੂੰ (2) ਕਿਉਂ ਚਾਹੁੰਦੇ ਹੋ?"
               ],
           },{
#	'key': 'why',
               # 'decomp': "*why can't i *",

               'key': 'ਕਿਉਂ',
               'decomp': "*ਮੈਂ ਕਿਉਂ ਨਹੀਂ*",
               'reasmb_neutral':
               [
                   "ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                   "ਕੀ ਤੁਹਾਨੂੰ ਵਿਸ਼ਵਾਸ ਹੈ ਕਿ ਇਹ ਤੁਹਾਡੀ ਮਦਦ ਕਰੇਗਾ?",
                   "ਕੀ ਤੁਹਾਨੂੰ ਕੋਈ ਪਤਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਉਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?"
               ],
               'reasmb_empathy':
                [
                   "ਮੈਂ ਇਸ ਨਾਲ ਅਸਹਿਮਤ ਹਾਂ...ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਅਜਿਹਾ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਇੱਥੇ ਆਪਣੇ ਆਪ ਤੇ ਬਹੁਤ ਸਖਤ ਹੋ ਰਹੇ ਹੋ... ਤੁਹਾਨੂੰ ਕਿਉਂ ਲਗਦਾ ਹੈ ਕਿ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਤੁਹਾਨੂੰ ਬਹੁਤ ਬੇਵੱਸ ਮਹਿਸੂਸ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ, ਪਰ ਮੈਂ ਤੁਹਾਡੀ ਗੱਲ ਨਾਲ ਅਸਹਿਮਤ ਹਾਂ... ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਮੈਂ ਸਮਝਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਕੀ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ, ਹਾਲਾਂਕਿ ਮੈਂ ਅਸਹਿਮਤ ਹਾਂ... ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ ਅਜਿਹਾ ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਆਪਣੇ ਲਈ ਦਿਆਲੂ ਹੋਣਾ ਮਹੱਤਵਪੂਰਨ ਹੈ। ਇਸ ਨਾਲ ਨਜਿੱਠਣ ਵਿੱਚ ਤੁਹਾਡੀ ਕੀ ਮਦਦ ਹੋ ਸਕਦੀ ਹੈ?",
                   "ਅਕਸਰ ਅਸੀਂ ਆਪਣੇ ਆਪ 'ਤੇ ਕਠੋਰ ਹੋ ਸਕਦੇ ਹਾਂ। ਕੀ ਤੁਹਾਨੂੰ ਲਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਇਸ ਭਾਵਨਾ 'ਤੇ ਸਵਾਲ ਕਰ ਸਕਦੇ ਹੋ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਕਹਿੰਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਤੁਸੀਂ ਕਿਉਂ ਸੋਚਦੇ ਹੋ ਕਿ ਤੁਹਾਨੂੰ (2) ਕਰਨ ਦੇ ਯੋਗ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ?",
                   "ਤੁਸੀਂ (2) ਦੇ ਯੋਗ ਕਿਉਂ ਹੋਣਾ ਚਾਹੁੰਦੇ ਹੋ?",
                   "ਤੁਸੀਂ ਕਿਉਂ ਵਿਸ਼ਵਾਸ ਕਰਦੇ ਹੋ ਕਿ ਇਹ (2) ਵਿੱਚ ਤੁਹਾਡੀ ਮਦਦ ਕਰੇਗਾ?",
                   "ਕੀ ਤੁਹਾਨੂੰ ਕੋਈ ਪਤਾ ਹੈ ਕਿ ਤੁਸੀਂ (2) ਕਿਉਂ ਨਹੀਂ ਕਰ ਸਕਦੇ?"
               ],
           },{
	#'key': 'everyone',
              #  'decomp': "*@everyone *",

               'key': 'ਹਰ ਕੋਈ',
               'decomp': "*@ਹਰ ਕੋਈ*",
               'reasmb_neutral':
               [
                   "ਮੈਂ ਸਮਝਦਾ ਹਾਂ। ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ?",
                   "ਕੀ ਤੁਸੀਂ ਇੱਕ ਬਹੁਤ ਹੀ ਖਾਸ ਵਿਅਕਤੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ?",
                   "ਕੋਈ ਖਾਸ ਸ਼ਾਇਦ?",
                   "ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਸ ਬਾਰੇ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?"
               ],
               'reasmb_empathy':
               [
                   "ਇਹ ਬਹੁਤ ਨਿਰਾਸ਼ਾਜਨਕ ਲੱਗਦਾ ਹੈ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਮੈਨੂੰ ਉਸ ਸਥਿਤੀ ਦਾ ਮੁਕਾਬਲਾ ਕਰਨ ਵਿੱਚ ਮੁਸ਼ਕਲ ਹੋਵੇਗੀ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਮੈਂ ਉਸ ਸਥਿਤੀ ਵਿੱਚ ਵੀ ਅਜਿਹਾ ਹੀ ਮਹਿਸੂਸ ਕਰਾਂਗਾ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਕੀ ਕੋਈ ਖਾਸ ਹੈ ਜਿਸ ਬਾਰੇ ਤੁਸੀਂ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਠੀਕ ਹੈ, ਇੱਕ ਉਦਾਹਰਣ ਕੌਣ ਹੋਵੇਗਾ? ਮੈਂ ਹੋਰ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।",
                   "ਕੀ ਤੁਸੀਂ ਆਪਣੇ ਕਿਸੇ ਨਜ਼ਦੀਕੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਕੀ ਕੋਈ ਖਾਸ ਹੈ ਜਿਸ ਬਾਰੇ ਤੁਸੀਂ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?",
                   "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਾਉਂਦਾ ਹੈ?",
                   "ਕੀ ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਕੋਈ ਖਾਸ ਵਿਅਕਤੀ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇੱਕ ਉਦਾਹਰਣ ਦੇ ਸਕਦੇ ਹੋ? ਮੈਂ ਤੁਹਾਡੀ ਬਿਹਤਰ ਮਦਦ ਕਰਨ ਲਈ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।"
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਮੈਂ ਸਮਝ ਗਿਆ, (2)?",
                   "ਯਕੀਨਨ ਨਹੀਂ (2)।",
                   "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ? ਕਿਉਂ?",
                   "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ?",
                   "ਕੀ ਤੁਸੀਂ ਬਹੁਤ ਖਾਸ ਵਿਅਕਤੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ? ਕਿਉਂ?",
                   "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ? ਕਿਉਂ?"
               ],
           },

   
            
            
            { #'key': 'everybody',
               # 'decomp': "*everybody *",
                'key': 'ਹਰ ਕੋਈ',
                'decomp': "*ਹਰ ਕੋਈ *",
                'reasmb_neutral': 
                [
                    "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ?",
                    "ਕੀ ਤੁਸੀਂ ਇੱਕ ਬਹੁਤ ਹੀ ਖਾਸ ਵਿਅਕਤੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                    "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ?",
                    "ਕੋਈ ਖਾਸ ਸ਼ਾਇਦ?",
                    "ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ?",
                    "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਸ ਬਾਰੇ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?"
                ],
                'reasmb_empathy':
                [
                    "ਮੈਂ ਇੱਥੇ ਤੁਹਾਡੇ ਨਾਲ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਮੈਂ ਤੁਹਾਡੇ ਕੋਨੇ ਵਿੱਚ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਮੈਂ ਇੱਥੇ ਤੁਹਾਡੀ ਸਥਿਤੀ ਦਾ ਸਮਰਥਨ ਕਰਦਾ ਹਾਂ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਮੈਨੂੰ ਇਸ ਨਾਲ ਨਜਿੱਠਣ ਵਿੱਚ ਮੁਸ਼ਕਲ ਹੋਵੇਗੀ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਇਹ ਥੋੜਾ ਡਰਾਉਣਾ ਲੱਗਦਾ ਹੈ... ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਕੀ ਕੋਈ ਖਾਸ ਹੈ ਜਿਸ ਬਾਰੇ ਤੁਸੀਂ ਸੋਚ ਰਹੇ ਹੋ?",
                    "ਠੀਕ ਹੈ, ਇੱਕ ਉਦਾਹਰਣ ਕੌਣ ਹੋਵੇਗਾ? ਮੈਂ ਹੋਰ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।",
                    "ਕੀ ਤੁਸੀਂ ਆਪਣੇ ਕਿਸੇ ਨਜ਼ਦੀਕੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                    "ਕੀ ਕੋਈ ਖਾਸ ਹੈ ਜਿਸ ਬਾਰੇ ਤੁਸੀਂ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?",
                    "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?",
                    "ਕੀ ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਕੋਈ ਖਾਸ ਵਿਅਕਤੀ ਹੈ?",
                    "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇੱਕ ਉਦਾਹਰਣ ਦੇ ਸਕਦੇ ਹੋ? ਮੈਂ ਤੁਹਾਡੀ ਬਿਹਤਰ ਮਦਦ ਕਰਨ ਲਈ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।"
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ? ਕਿਉਂ?",
                    "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ? ਕਿਉਂ?",
                    "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ? ਕਿਉਂ?",
                    "ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਨਹੀਂ? ਕਿਉਂ?",
                ],
            }



            ,
            {
                  #   -----------------  do we need to add the two words to make them one -----------------
             

                # 'key': 'noone',
                # 'decomp': "*noone *",  
                'key': 'ਕੋਈ ਨਹੀਂ',
                'decomp': "*ਕੋਈ ਨਹੀਂ *",
                'reasmb_neutral': 
                [
                    "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                    "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ?",
                    "ਕੀ ਤੁਸੀਂ ਇੱਕ ਬਹੁਤ ਹੀ ਖਾਸ ਵਿਅਕਤੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                    "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ?",
                    "ਕੋਈ ਖਾਸ ਸ਼ਾਇਦ?",
                    "ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ?",
                    "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਸ ਬਾਰੇ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?"
                ],
                'reasmb_empathy':
                [
                    "ਤੁਹਾਨੂੰ ਇਹ ਸੋਚਣ ਦਾ ਕੀ ਕਾਰਨ ਹੈ?",
                    "ਇਹ ਸੁਣ ਕੇ ਮੈਨੂੰ ਦੁੱਖ ਹੋਇਆ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿੱਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                    "ਤੁਸੀਂ ਇਨ੍ਹਾਂ ਭਾਵਨਾਵਾਂ ਨਾਲ ਸਿੱਝਣ ਲਈ ਇੰਨੇ ਮਜ਼ਬੂਤ ​​ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                    "ਮੈਂ ਮਹਿਸੂਸ ਕਰ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਬਹੁਤ ਦਰਦ ਵਿੱਚ ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿੱਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                    "ਕੀ ਤੁਸੀਂ ਕਿਸੇ ਖਾਸ ਘਟਨਾ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ? ਮੈਂ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।",
                    "ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਇਹ ਤੁਹਾਡੇ ਲਈ ਕੀ ਭਾਵਨਾਵਾਂ ਲਿਆਉਂਦਾ ਹੈ?",
                    "ਮੈਂ ਮਦਦ ਕਰਨਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਥੋੜਾ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?",
                    "ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ, ਤੁਸੀਂ ਇਹ ਸੋਚਣ ਲਈ ਕੀ ਕੀਤਾ?"
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ? ਕਿਉਂ?",
                    "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ? ਕਿਉਂ?",
                    "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ? ਕਿਉਂ?",
                    "ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ? ਕਿਉਂ?",
                ]
            }
            
            
            ,{
	#'key': 'nobody',
              #  'decomp': "*nobody *",

               'key': 'ਕੋਈ ਨਹੀਂ',
               'decomp': "*ਕੋਈ ਨਹੀਂ *",
               'reasmb_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ?",
                   "ਕੀ ਤੁਸੀਂ ਇੱਕ ਬਹੁਤ ਹੀ ਖਾਸ ਵਿਅਕਤੀ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ?",
                   "ਕੋਈ ਖਾਸ ਸ਼ਾਇਦ?",
                   "ਤੁਹਾਡੇ ਮਨ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ?",
                   "ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਸ ਬਾਰੇ ਗੱਲ ਕਰ ਰਹੇ ਹੋ?"
               ],
               'reasmb_empathy':
               [
                   "ਤੁਹਾਨੂੰ ਇਹ ਸੋਚਣ ਦਾ ਕੀ ਕਾਰਨ ਹੈ?",
                   "ਇਹ ਸੁਣ ਕੇ ਮੈਨੂੰ ਦੁੱਖ ਹੋਇਆ ਕਿ ਤੁਸੀਂ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਸੂਸ ਕਰ ਰਹੇ ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿੱਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                   "ਤੁਸੀਂ ਇਨ੍ਹਾਂ ਭਾਵਨਾਵਾਂ ਨਾਲ ਸਿੱਝਣ ਲਈ ਇੰਨੇ ਮਜ਼ਬੂਤ ​​ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                   "ਮੈਂ ਮਹਿਸੂਸ ਕਰ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਬਹੁਤ ਦਰਦ ਵਿੱਚ ਹੋ... ਤੁਹਾਡੇ ਖ਼ਿਆਲ ਵਿੱਚ ਕੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹੈ?",
                   "ਕੀ ਤੁਸੀਂ ਕਿਸੇ ਖਾਸ ਘਟਨਾ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ? ਮੈਂ ਸਮਝਣਾ ਚਾਹੁੰਦਾ ਹਾਂ।",
                   "ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਇਹ ਤੁਹਾਡੇ ਲਈ ਕੀ ਭਾਵਨਾਵਾਂ ਲਿਆਉਂਦਾ ਹੈ?",
                   "ਮੈਂ ਮਦਦ ਕਰਨਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਇਸ ਬਾਰੇ ਥੋੜਾ ਹੋਰ ਦੱਸ ਸਕਦੇ ਹੋ ਕਿ ਤੁਸੀਂ ਅਜਿਹਾ ਕਿਉਂ ਸੋਚਦੇ ਹੋ?",
                   "ਮੈਨੂੰ ਹੋਰ ਦੱਸੋ, ਤੁਹਾਨੂੰ ਇਸ ਬਾਰੇ ਕੀ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕੀਤਾ?"
               ],
               'reasmb_dynamic_neutral':
               [
                 "ਕੀ ਤੁਸੀਂ ਖਾਸ ਤੌਰ 'ਤੇ ਕਿਸੇ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ? ਕਿਉਂ?",
                   "ਕੌਣ, ਉਦਾਹਰਨ ਲਈ? ਕਿਉਂ?",
                   "ਕੌਣ, ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ? ਕਿਉਂ?",
                   "ਤੁਹਾਡੇ ਦਿਮਾਗ ਵਿੱਚ ਇੱਕ ਖਾਸ ਵਿਅਕਤੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਨਹੀਂ? ਕਿਉਂ?",
               ]
           },{
	#'key': 'always',
              #  'decomp': "*always*",

               'key': 'ਹਮੇਸ਼ਾ',
               'decomp': "*ਹਮੇਸ਼ਾ*",
               'reasmb_neutral':
               [
                   "ਕੀ ਤੁਸੀਂ ਇੱਕ ਖਾਸ ਉਦਾਹਰਣ ਬਾਰੇ ਸੋਚ ਸਕਦੇ ਹੋ?",
                   "ਜਦੋਂ ?",
                   "ਤੁਸੀਂ ਕਿਹੜੀ ਘਟਨਾ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਹਮੇਸ਼ਾ?"
               ],
               'reasmb_empathy':
               [
                   "ਕੀ ਤੁਸੀਂ ਮੈਨੂੰ ਕੋਈ ਖਾਸ ਉਦਾਹਰਣ ਦੇ ਸਕਦੇ ਹੋ?",
                   "ਕੀ ਜੇ ਇਹ ਬਦਲ ਸਕਦਾ ਹੈ?",
                   "ਕੀ ਕੋਈ ਖਾਸ ਚੀਜ਼ ਹੈ ਜੋ ਤੁਹਾਨੂੰ ਇਹ ਸੋਚਣ ਲਈ ਮਜਬੂਰ ਕਰਦੀ ਹੈ?",
                   "ਹਮੇਸ਼ਾ? ਜਾਂ ਕੀ ਇਹ ਬਦਲ ਸਕਦਾ ਹੈ? ਜੇ ਤੁਸੀਂ ਕਰ ਸਕਦੇ ਹੋ ਤਾਂ ਮੈਨੂੰ ਥੋੜਾ ਹੋਰ ਦੱਸੋ."
               ],
               'reasmb_dynamic_neutral':
               [
                   "ਜਦੋਂ?",
                   "ਤੁਸੀਂ ਕਿਹੜੀ ਘਟਨਾ ਬਾਰੇ ਸੋਚ ਰਹੇ ਹੋ?",
                   "ਹਮੇਸ਼ਾ ਕਿਉਂ?"
               ],
           },{
#	'key': 'alike',
  #              'decomp': "* alike *",

               'key': 'ਇਕਸਾਰ',
               'decomp': "* 'ਇਕਸਾਰ' *",
               'reasmb_neutral':
               [
                   "ਕਿਸ ਤਰੀਕੇ ਨਾਲ ?",
                   "ਤੁਸੀਂ ਕਿਹੜੀ ਸਮਾਨਤਾ ਦੇਖਦੇ ਹੋ?",
                   "ਇਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                   "ਤੁਸੀਂ ਹੋਰ ਕਿਹੜੇ ਕੁਨੈਕਸ਼ਨ ਦੇਖਦੇ ਹੋ?",
                   "ਤੁਸੀਂ ਇਸ ਸਮਾਨਤਾ ਦਾ ਕੀ ਮਤਲਬ ਸਮਝਦੇ ਹੋ?",
                   "ਕੀ ਕੁਨੈਕਸ਼ਨ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ?",
                   "ਕੀ ਅਸਲ ਵਿੱਚ ਕੋਈ ਕੁਨੈਕਸ਼ਨ ਹੋ ਸਕਦਾ ਹੈ?"
               ],
               'reasmb_empathy':
               [
                   "ਇਹ ਇੱਕ ਸਮਝਦਾਰ ਤੁਲਨਾ ਹੈ...ਕਿਸੇ ਤਰੀਕੇ ਨਾਲ?",
                   "ਮੈਂ ਤੁਹਾਡੀ ਪ੍ਰਸ਼ੰਸਾ ਕਰਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਮੈਨੂੰ ਇਹ ਦੱਸ ਰਹੇ ਹੋ...ਕਿਸੇ ਤਰੀਕੇ ਨਾਲ?",
                    "ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਕਿਹੜੀਆਂ ਸਮਾਨਤਾਵਾਂ ਦੇਖਦੇ ਹੋ?",
                    "ਇਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                    "ਕੀ ਤੁਸੀਂ ਹੋਰ ਸਮਾਨਤਾਵਾਂ ਦੇਖਦੇ ਹੋ?",
                    "ਮੈਂ ਹੋਰ ਸੁਣਨਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਇਸ ਸਮਾਨਤਾ ਦਾ ਕੀ ਮਤਲਬ ਹੋ ਸਕਦਾ ਹੈ?",
                    "ਇਹ ਸਮਾਨਤਾਵਾਂ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦੀਆਂ ਹਨ?",
                    "ਮੇਰੇ ਨਾਲ ਇਸ ਨੂੰ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ. ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਾਉਂਦਾ ਹੈ?"
                ],
                'reasmb_dynamic_neutral':
                [
                    "ਕਿਸ ਤਰੀਕੇ ਨਾਲ?",
                    "ਇਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                    "ਤੁਸੀਂ ਹੋਰ ਕਿਹੜੇ ਕੁਨੈਕਸ਼ਨ ਦੇਖਦੇ ਹੋ?",
                    "ਤੁਸੀਂ ਇਸ ਸਮਾਨਤਾ ਦਾ ਕੀ ਮਤਲਬ ਸਮਝਦੇ ਹੋ?",
                    "ਕੁਨੈਕਸ਼ਨ ਕੀ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ?"
                ],
            }
,{
                # 'key': 'like',
                # 'decomp': "* @be * like *",
                'key': 'ਜਿਵੇਂ',
                'decomp': "* @ਬਣੋ * ਜਿਵੇਂ *", # ------- HAD TO CHANGE THE SYMMETRY
                'reasmb_neutral': 
                [
                    "ਕਿਸ ਤਰੀਕੇ ਨਾਲ ?",
                    "ਤੁਸੀਂ ਕਿਹੜੀ ਸਮਾਨਤਾ ਦੇਖਦੇ ਹੋ ?",
                    "ਉਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                    "ਤੁਸੀਂ ਹੋਰ ਕਿਹੜੇ ਕੁਨੈਕਸ਼ਨ ਦੇਖਦੇ ਹੋ ?",
                    "ਤੁਸੀਂ ਕੀ ਮੰਨਦੇ ਹੋ ਕਿ ਸਮਾਨਤਾ ਦਾ ਮਤਲਬ ਹੈ ?",
                    "ਕੀ ਕੁਨੈਕਸ਼ਨ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ?", # ---------------WEIRD SENTENCE ------
                    "ਕੀ ਅਸਲ ਵਿੱਚ ਕੁਝ ਕੁਨੈਕਸ਼ਨ ਹੋ ਸਕਦਾ ਹੈ ?"
                ],
                'reasmb_empathy':
                [
                    "ਤੁਸੀਂ ਪੂਰੀ ਤਰ੍ਹਾਂ ਸਮਝ ਰਹੇ ਹੋ...ਕੀ ਮੈਂ ਪੁੱਛ ਸਕਦਾ ਹਾਂ ਕਿ ਤੁਸੀਂ ਕਿਹੜੀਆਂ ਸਮਾਨਤਾਵਾਂ ਦੇਖਦੇ ਹੋ?",
                    "ਮੈਂ ਤੁਹਾਡੀ ਗੱਲ ਨਾਲ ਸਹਿਮਤ ਹਾਂ...ਇਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                    "ਤੁਸੀਂ ਪੂਰੀ ਤਰ੍ਹਾਂ ਸਮਝ ਰਹੇ ਹੋ...ਕੀ ਤੁਸੀਂ ਹੋਰ ਸਮਾਨਤਾਵਾਂ ਦੇਖਦੇ ਹੋ?",
                    "ਮੈਂ ਹੋਰ ਸੁਣਨਾ ਚਾਹੁੰਦਾ ਹਾਂ। ਤੁਹਾਨੂੰ ਕੀ ਲੱਗਦਾ ਹੈ ਕਿ ਇਸ ਸਮਾਨਤਾ ਦਾ ਕੀ ਮਤਲਬ ਹੋ ਸਕਦਾ ਹੈ?",
                    "ਤੁਸੀਂ ਪੂਰੀ ਤਰ੍ਹਾਂ ਸਮਝ ਰਹੇ ਹੋ...ਇਹ ਸਮਾਨਤਾਵਾਂ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦੀਆਂ ਹਨ?",
                    "ਮੇਰੇ ਨਾਲ ਇਹ ਸਾਂਝਾ ਕਰਨ ਲਈ ਤੁਹਾਡਾ ਧੰਨਵਾਦ। ਇਹ ਤੁਹਾਨੂੰ ਕਿਵੇਂ ਮਹਿਸੂਸ ਕਰਦਾ ਹੈ?"
                ],
                'reasmb_dynamic_neutral': 
                [
                    "ਕਿਸ ਤਰੀਕੇ ਨਾਲ?",
                    "ਤੁਸੀਂ ਕਿਹੜੀ ਸਮਾਨਤਾ ਦੇਖਦੇ ਹੋ?",
                    "ਇਹ ਸਮਾਨਤਾ ਤੁਹਾਨੂੰ ਕੀ ਸੁਝਾਅ ਦਿੰਦੀ ਹੈ?",
                    "ਤੁਸੀਂ ਹੋਰ ਕਿਹੜੇ ਕੁਨੈਕਸ਼ਨ ਦੇਖਦੇ ਹੋ?",
                    "ਤੁਸੀਂ ਇਸ ਸਮਾਨਤਾ ਦਾ ਕੀ ਮਤਲਬ ਸਮਝਦੇ ਹੋ?",
                    "ਕੀ ਕੁਨੈਕਸ਼ਨ ਹੈ, ਕੀ ਤੁਸੀਂ ਮੰਨਦੇ ਹੋ?", # -------------- WEIRD SENTENCE "What is the connection, do you suppose?",
                    "ਕੀ ਅਸਲ ਵਿੱਚ ਕੋਈ ਕੁਨੈਕਸ਼ਨ ਹੋ ਸਕਦਾ ਹੈ?"
                ],
            }
        ]
    }  

  
    def find_syns(self, word):
        syn_ars = self.sample_generator_rules['synonyms']
        for ar in syn_ars:
            if word in ar:
                return ar
        return []

    def replace_decomp_with_syns(self, decomp):
        reg = regex.findall( r'@\w+' ,decomp)
        if reg:
            reg = reg[0][1:]
            return decomp.replace('@'+reg, '('+'|'.join(self.find_syns(reg))+')')
        return decomp

    # def calculate_cosine_simillarity_with_rule_keys(self, user_input, decomposition_rules):
    #     for dec_rule in decomposition_rules:
    #         cos_similarities= []
    #         cos_similarity = get_sentence_similarity(user_input, dec_rule, 'pa')
    #         cos_similarities.append((
    #             sim_score1,
    #             docs_sent_token
    #         ))
    #     cos_similarities.sort(key=lambda k: k[0], reverse=True)
    #     cos_similarities = [set(t) for t in cos_similarities]

    #     result = []
    #     for i in cos_similarities:
    #         result.append(i[1])
    #     return result




    def rank_sent_for_tags(self, sentence, tags, reasmb_rule):
        result = {}
        sentence = sentence.lower()

        import_words = []
        tokens = word_tokenize(sentence) 
        # _ = tokenize(sentence ,'pa')
        print(tokens)
        # # tokens = word_tokenize(sentence)
        # tokens = []
        # for i in _:
        #     tokens.append(i[1:])
        # print(tokens)
        # print(' pos tokens ' , nltk.pos_tag(tokens))
        for word in tokens:
            # if(word[1] in ('NN', 'NNS', 'NNP', 'JJ', 'ADV', 'VB', 'VBG', 'VBP', 'PRP') or word[0] in ('ਨਹੀਂ', 'ਜੇਕਰ','ਜੇ', 'ਸੁਪਨਾ')): # cannot include 'yes' here
            if(word in ('ਨਹੀਂ', 'ਜੇਕਰ','ਜੇ', 'ਸੁਪਨਾ')): # cannot include 'yes' here
                import_words.append(word)
        
        rule_keys = list(map(lambda x:x[1],tags))
        print('sentence', sentence)

        # print ( 'rule keys ------------',rule_keys)

        # most_simillar_keys_from_CosSimilarity = self.calculate_cosine_simillarity_with_rule_keys(sentence, rule_keys)
        # print('cosine similari ------------',most_simillar_keys_from_CosSimilarity)

        for tag in tags:
            ranking = {'key':tag[0], 'score':0.00001, 'decomp':tag[1], reasmb_rule:tag[2]}
            if tag[0] in import_words:
                if tag[0] not in ("ਮੈਂ", "ਹਾਂ"): 
                    ranking['score'] += 1
                else:
                    ranking['score'] += 0.3

            # if tag[1] in most_simillar_keys_from_CosSimilarity:
            #     ranking['score']+=10

            for imp_word in import_words:

                #adding effect of decomp rules to scores
                decomp_with_syn = self.replace_decomp_with_syns(tag[1])
                for decomp_word in decomp_with_syn.replace("|", " ").replace("(", " ").replace(")", " ").split(" "):
                    if decomp_word == imp_word:
                        if decomp_word not in ("ਮੈਂ", "ਹਾਂ") : 
                            ranking['score'] += 0.5
                        else:
                            ranking['score'] += 0.3

                
            #ranking['score'] /= len(import_words)

            number_of_stars = len(list(filter(lambda i: i=='*' ,tag[1])))
            ranking['score'] += number_of_stars*0.30
            
            #checking if decomp works
            reg = self.replace_decomp_with_syns(tag[1])
            reg = reg.replace('*', r'(.*)?').replace(' ', r'\s')
            ranking['decomp'] = reg
            found = regex.findall(reg, sentence)
            if reg == "(.*)?i\\s(ਇੱਛਾ|ਚਾਹੁੰਦੇ|ਚਾਹੁੰਦਾ|ਚਾਹੀਦਾ)\\s(.*)?":
                print(reg, sentence)
            if found:
                ranking['score'] += 20
                print("this rulecan decompose= ",reg)

            if ranking['key'] in result and float(ranking['score'])>float(result[ranking['key']]['score']):
                result[ranking['key']] = ranking
            elif ranking['key'] not in result:
                result[ranking['key']] = ranking

        return result

    def remove_repetetive_words_together(self, sent):
        res = []
        previous_word = ""
        for word in sent.split():
            if previous_word != word:
                res.append(word)
            previous_word = word
        return " ".join(res)

    def generate_eliza_response(self, decomp, user_inpt, reasmbl):
        user_inpt = user_inpt.lower()
        result = regex.search(decomp, user_inpt)
        reasmbl_res = regex.findall(r'\(\d\)' ,reasmbl)
        ar_indexes = []
        for reasmbl_chunks in reasmbl_res:
            index = reasmbl_chunks[1:2]
            ar_indexes.append(index)
        
        if '|' in decomp:
            for gp in result.groups():
                if self.find_syns(gp):
                    ar_indexes = list(map(lambda i: {'old':i, 'new':int(i)+1} if int(i) >=result.groups().index(gp)+1 else {'old':i, 'new':i} ,ar_indexes))
        
        generated_response = reasmbl
        for index in ar_indexes:
            res = ""
            if type(index) is not dict:
                res = result.groups()[int(index)-1]
                res = res.replace(' ਤੁਸੀ ', ' ਮੈਂ ')\
                    .replace(' ਮੈਂ ', ' ਤੁਸੀ ')\
                    .replace(" ਮੈਂ ਹਾਂ ", ' ਤੁਸੀ ਹੋੋ ')\
                    .replace(' ਮੇਰੀ ', ' ਤੁਹਾਡੀ ')\
                    .replace('ਤੁਹਾਡੀ ', 'ਮੇਰੀ ')\
                    .replace(' ਹਾਂ ', ' ਹੋੋ ')\
                    .replace(' ਮੈਨੂੰ', ' ਤੁਹਾਨੂੰ')\
                    .replace(' ਮੈਂ ', ' ਤੁਸੀ ')
                      # .replace(' noone', ' no one')\.     ------------ > combine words?

                generated_response = generated_response.replace("("+str(index)+")", res)
            else:
                if int(index['new']) != int(index['old']) and int(index['old'])-1 > 0 and int(index['new'])-1>0:
                    res = list(result.groups())[int(index['old'])-1] + " " + result.groups()[int(index['new'])-1]
                else:
                    res = result.groups()[int(index['new'])-1]

                res = res.replace(' ਤੁਸੀ ', ' ਮੈਂ ')\
                    .replace(' ਮੈਂ ', ' ਤੁਸੀ ')\
                    .replace(" ਮੈਂ ਹਾਂ ", ' ਤੁਸੀ ਹੋੋ ')\
                    .replace(' ਮੇਰੀ ', ' ਤੁਹਾਡੀ ')\
                    .replace('ਤੁਹਾਡੀ ', 'ਮੇਰੀ ')\
                    .replace(' ਹਾਂ ', ' ਹੋੋ ')\
                    .replace(' ਮੈਨੂੰ', ' ਤੁਹਾਨੂੰ')\
                    .replace(' ਮੈਂ ', ' ਤੁਸੀ ')
                    # .replace(' noone', ' no one')\.     ------------ > combine words?
                generated_response = generated_response.replace("("+str(index['old'])+")", res)
            
        generated_response = generated_response.replace("  ", " ").replace(". .", ".").replace(". ?", "?").replace("? .", ".").replace("..", ".").replace(".?", "?").replace("?.", ".").replace("' ", "")
        print("decomp= ", decomp)
        return generated_response
        
    #this is the main function which generates final response
    def generate_final_response(self, user_sentence, num_run_eliza, generate_from_reasmbl3):
        user_sentence = user_sentence[:-1]
        user_sentence = user_sentence.replace("  ", " ")#.replace(" no one ", " noone ")
        reasmb_rule = 'reasmb_empathy'
        if num_run_eliza>1: reasmb_rule = 'reasmb_neutral'
        if generate_from_reasmbl3: reasmb_rule = 'reasmb_dynamic_neutral'

        key_score_decomp_ar = self.rank_sent_for_tags(user_sentence, list(map(lambda c: [c['key'], c['decomp'], c[reasmb_rule]] ,self.sample_generator_rules['dec_rules'])), reasmb_rule)
        best_key_decomp_reasmb = list(map(lambda i: i[1] ,sorted(key_score_decomp_ar.items(), key=lambda i: i[1]['score'], reverse=True)[:5]))[0]
        gen = self.generate_eliza_response(best_key_decomp_reasmb['decomp'], user_sentence, random.choice(best_key_decomp_reasmb[reasmb_rule]))
        gen = self.remove_repetetive_words_together(gen)
        print('key=',best_key_decomp_reasmb['key'])
        is_dynamic = "(dynamic)" if generate_from_reasmbl3 else "(static)"
        print("rule-based generated response: "+is_dynamic, gen)
        return {"response":gen, "key":best_key_decomp_reasmb['key']}

    



